Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xe34 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xd1ad4): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xbdeb2): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xbdae): C:/RTOS/RTOS1/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 9 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x69b77): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x3daf6): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 9 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xcd93a): unsigned char
 <1><44>: Abbrev Number: 9 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x9e9e2): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xadbef): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 9 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xcc1ed): short unsigned int
 <1><5e>: Abbrev Number: 9 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x126c3): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x873f3): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 9 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5090e): long unsigned int
 <1><78>: Abbrev Number: 9 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x60195): long long int
 <1><7f>: Abbrev Number: 9 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x2c912): long long unsigned int
 <1><86>: Abbrev Number: 28 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 9 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x11c79): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x3daf8): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0xadbf1): uint16_t
    <a5>   DW_AT_decl_file   : 4
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xcbd7b): uint32_t
    <b1>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 15 (DW_TAG_array_type)
    <be>   DW_AT_type        : <0xac>
    <c2>   DW_AT_sibling     : <0xcd>
 <2><c6>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c7>   DW_AT_type        : <0x8d>
    <cb>   DW_AT_upper_bound : 1
 <2><cc>: Abbrev Number: 0
 <1><cd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ce>   DW_AT_byte_size   : 24
    <cf>   DW_AT_decl_file   : 5
    <d0>   DW_AT_decl_line   : 362
    <d2>   DW_AT_decl_column : 9
    <d2>   DW_AT_sibling     : <0x124>
 <2><d6>: Abbrev Number: 5 (DW_TAG_member)
    <d7>   DW_AT_name        : CR
    <da>   DW_AT_decl_file   : 5
    <da>   DW_AT_decl_line   : 364
    <dc>   DW_AT_decl_column : 17
    <dc>   DW_AT_type        : <0xb8>
    <e0>   DW_AT_data_member_location: 0
 <2><e1>: Abbrev Number: 1 (DW_TAG_member)
    <e2>   DW_AT_name        : (indirect string, offset: 0x19b85): NDTR
    <e6>   DW_AT_decl_file   : 5
    <e7>   DW_AT_decl_line   : 365
    <e9>   DW_AT_decl_column : 17
    <ea>   DW_AT_type        : <0xb8>
    <ee>   DW_AT_data_member_location: 4
 <2><ef>: Abbrev Number: 5 (DW_TAG_member)
    <f0>   DW_AT_name        : PAR
    <f4>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 366
    <f6>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xb8>
    <fa>   DW_AT_data_member_location: 8
 <2><fb>: Abbrev Number: 1 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x57440): M0AR
    <100>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 367
    <103>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xb8>
    <108>   DW_AT_data_member_location: 12
 <2><109>: Abbrev Number: 1 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x7502f): M1AR
    <10e>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 368
    <111>   DW_AT_decl_column : 17
    <112>   DW_AT_type        : <0xb8>
    <116>   DW_AT_data_member_location: 16
 <2><117>: Abbrev Number: 5 (DW_TAG_member)
    <118>   DW_AT_name        : FCR
    <11c>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 369
    <11e>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xb8>
    <122>   DW_AT_data_member_location: 20
 <2><123>: Abbrev Number: 0
 <1><124>: Abbrev Number: 10 (DW_TAG_typedef)
    <125>   DW_AT_name        : (indirect string, offset: 0x1aa7b): DMA_Stream_TypeDef
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 370
    <12c>   DW_AT_decl_column : 3
    <12c>   DW_AT_type        : <0xcd>
 <1><130>: Abbrev Number: 15 (DW_TAG_array_type)
    <131>   DW_AT_type        : <0xb8>
    <135>   DW_AT_sibling     : <0x140>
 <2><139>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <13a>   DW_AT_type        : <0x8d>
    <13e>   DW_AT_upper_bound : 1
 <2><13f>: Abbrev Number: 0
 <1><140>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <141>   DW_AT_type        : <0x130>
 <1><145>: Abbrev Number: 13 (DW_TAG_structure_type)
    <146>   DW_AT_byte_size   : 40
    <147>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 458
    <14a>   DW_AT_decl_column : 9
    <14a>   DW_AT_sibling     : <0x1c7>
 <2><14e>: Abbrev Number: 1 (DW_TAG_member)
    <14f>   DW_AT_name        : (indirect string, offset: 0x1a4f): MODER
    <153>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 460
    <156>   DW_AT_decl_column : 17
    <157>   DW_AT_type        : <0xb8>
    <15b>   DW_AT_data_member_location: 0
 <2><15c>: Abbrev Number: 1 (DW_TAG_member)
    <15d>   DW_AT_name        : (indirect string, offset: 0xa4b71): OTYPER
    <161>   DW_AT_decl_file   : 5
    <162>   DW_AT_decl_line   : 461
    <164>   DW_AT_decl_column : 17
    <165>   DW_AT_type        : <0xb8>
    <169>   DW_AT_data_member_location: 4
 <2><16a>: Abbrev Number: 1 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0xb96d5): OSPEEDR
    <16f>   DW_AT_decl_file   : 5
    <170>   DW_AT_decl_line   : 462
    <172>   DW_AT_decl_column : 17
    <173>   DW_AT_type        : <0xb8>
    <177>   DW_AT_data_member_location: 8
 <2><178>: Abbrev Number: 1 (DW_TAG_member)
    <179>   DW_AT_name        : (indirect string, offset: 0x89437): PUPDR
    <17d>   DW_AT_decl_file   : 5
    <17e>   DW_AT_decl_line   : 463
    <180>   DW_AT_decl_column : 17
    <181>   DW_AT_type        : <0xb8>
    <185>   DW_AT_data_member_location: 12
 <2><186>: Abbrev Number: 5 (DW_TAG_member)
    <187>   DW_AT_name        : IDR
    <18b>   DW_AT_decl_file   : 5
    <18b>   DW_AT_decl_line   : 464
    <18d>   DW_AT_decl_column : 17
    <18d>   DW_AT_type        : <0xb8>
    <191>   DW_AT_data_member_location: 16
 <2><192>: Abbrev Number: 5 (DW_TAG_member)
    <193>   DW_AT_name        : ODR
    <197>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 465
    <199>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0xb8>
    <19d>   DW_AT_data_member_location: 20
 <2><19e>: Abbrev Number: 1 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0x2fe3f): BSRR
    <1a3>   DW_AT_decl_file   : 5
    <1a4>   DW_AT_decl_line   : 466
    <1a6>   DW_AT_decl_column : 17
    <1a7>   DW_AT_type        : <0xb8>
    <1ab>   DW_AT_data_member_location: 24
 <2><1ac>: Abbrev Number: 1 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0xb6a5d): LCKR
    <1b1>   DW_AT_decl_file   : 5
    <1b2>   DW_AT_decl_line   : 467
    <1b4>   DW_AT_decl_column : 17
    <1b5>   DW_AT_type        : <0xb8>
    <1b9>   DW_AT_data_member_location: 28
 <2><1ba>: Abbrev Number: 5 (DW_TAG_member)
    <1bb>   DW_AT_name        : AFR
    <1bf>   DW_AT_decl_file   : 5
    <1bf>   DW_AT_decl_line   : 468
    <1c1>   DW_AT_decl_column : 17
    <1c1>   DW_AT_type        : <0x140>
    <1c5>   DW_AT_data_member_location: 32
 <2><1c6>: Abbrev Number: 0
 <1><1c7>: Abbrev Number: 10 (DW_TAG_typedef)
    <1c8>   DW_AT_name        : (indirect string, offset: 0xceedf): GPIO_TypeDef
    <1cc>   DW_AT_decl_file   : 5
    <1cd>   DW_AT_decl_line   : 469
    <1cf>   DW_AT_decl_column : 3
    <1cf>   DW_AT_type        : <0x145>
 <1><1d3>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1d4>   DW_AT_byte_size   : 8
    <1d5>   DW_AT_decl_file   : 5
    <1d6>   DW_AT_decl_line   : 540
    <1d8>   DW_AT_decl_column : 9
    <1d8>   DW_AT_sibling     : <0x1f4>
 <2><1dc>: Abbrev Number: 5 (DW_TAG_member)
    <1dd>   DW_AT_name        : CR
    <1e0>   DW_AT_decl_file   : 5
    <1e0>   DW_AT_decl_line   : 542
    <1e2>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0xb8>
    <1e6>   DW_AT_data_member_location: 0
 <2><1e7>: Abbrev Number: 5 (DW_TAG_member)
    <1e8>   DW_AT_name        : CSR
    <1ec>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 543
    <1ee>   DW_AT_decl_column : 17
    <1ee>   DW_AT_type        : <0xb8>
    <1f2>   DW_AT_data_member_location: 4
 <2><1f3>: Abbrev Number: 0
 <1><1f4>: Abbrev Number: 10 (DW_TAG_typedef)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x99a45): PWR_TypeDef
    <1f9>   DW_AT_decl_file   : 5
    <1fa>   DW_AT_decl_line   : 544
    <1fc>   DW_AT_decl_column : 3
    <1fc>   DW_AT_type        : <0x1d3>
 <1><200>: Abbrev Number: 13 (DW_TAG_structure_type)
    <201>   DW_AT_byte_size   : 152
    <202>   DW_AT_decl_file   : 5
    <203>   DW_AT_decl_line   : 550
    <205>   DW_AT_decl_column : 9
    <205>   DW_AT_sibling     : <0x3df>
 <2><209>: Abbrev Number: 5 (DW_TAG_member)
    <20a>   DW_AT_name        : CR
    <20d>   DW_AT_decl_file   : 5
    <20d>   DW_AT_decl_line   : 552
    <20f>   DW_AT_decl_column : 17
    <20f>   DW_AT_type        : <0xb8>
    <213>   DW_AT_data_member_location: 0
 <2><214>: Abbrev Number: 1 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x94b2f): PLLCFGR
    <219>   DW_AT_decl_file   : 5
    <21a>   DW_AT_decl_line   : 553
    <21c>   DW_AT_decl_column : 17
    <21d>   DW_AT_type        : <0xb8>
    <221>   DW_AT_data_member_location: 4
 <2><222>: Abbrev Number: 1 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0xc1422): CFGR
    <227>   DW_AT_decl_file   : 5
    <228>   DW_AT_decl_line   : 554
    <22a>   DW_AT_decl_column : 17
    <22b>   DW_AT_type        : <0xb8>
    <22f>   DW_AT_data_member_location: 8
 <2><230>: Abbrev Number: 5 (DW_TAG_member)
    <231>   DW_AT_name        : CIR
    <235>   DW_AT_decl_file   : 5
    <235>   DW_AT_decl_line   : 555
    <237>   DW_AT_decl_column : 17
    <237>   DW_AT_type        : <0xb8>
    <23b>   DW_AT_data_member_location: 12
 <2><23c>: Abbrev Number: 1 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0xa96a9): AHB1RSTR
    <241>   DW_AT_decl_file   : 5
    <242>   DW_AT_decl_line   : 556
    <244>   DW_AT_decl_column : 17
    <245>   DW_AT_type        : <0xb8>
    <249>   DW_AT_data_member_location: 16
 <2><24a>: Abbrev Number: 1 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x8a3e4): AHB2RSTR
    <24f>   DW_AT_decl_file   : 5
    <250>   DW_AT_decl_line   : 557
    <252>   DW_AT_decl_column : 17
    <253>   DW_AT_type        : <0xb8>
    <257>   DW_AT_data_member_location: 20
 <2><258>: Abbrev Number: 1 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x5b7cc): AHB3RSTR
    <25d>   DW_AT_decl_file   : 5
    <25e>   DW_AT_decl_line   : 558
    <260>   DW_AT_decl_column : 17
    <261>   DW_AT_type        : <0xb8>
    <265>   DW_AT_data_member_location: 24
 <2><266>: Abbrev Number: 1 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0xc8de9): RESERVED0
    <26b>   DW_AT_decl_file   : 5
    <26c>   DW_AT_decl_line   : 559
    <26e>   DW_AT_decl_column : 17
    <26f>   DW_AT_type        : <0xac>
    <273>   DW_AT_data_member_location: 28
 <2><274>: Abbrev Number: 1 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x188e0): APB1RSTR
    <279>   DW_AT_decl_file   : 5
    <27a>   DW_AT_decl_line   : 560
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xb8>
    <281>   DW_AT_data_member_location: 32
 <2><282>: Abbrev Number: 1 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x5b244): APB2RSTR
    <287>   DW_AT_decl_file   : 5
    <288>   DW_AT_decl_line   : 561
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0xb8>
    <28f>   DW_AT_data_member_location: 36
 <2><290>: Abbrev Number: 1 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0xc8df3): RESERVED1
    <295>   DW_AT_decl_file   : 5
    <296>   DW_AT_decl_line   : 562
    <298>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xbd>
    <29d>   DW_AT_data_member_location: 40
 <2><29e>: Abbrev Number: 1 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0x11c0e): AHB1ENR
    <2a3>   DW_AT_decl_file   : 5
    <2a4>   DW_AT_decl_line   : 563
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0xb8>
    <2ab>   DW_AT_data_member_location: 48
 <2><2ac>: Abbrev Number: 1 (DW_TAG_member)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x3857b): AHB2ENR
    <2b1>   DW_AT_decl_file   : 5
    <2b2>   DW_AT_decl_line   : 564
    <2b4>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xb8>
    <2b9>   DW_AT_data_member_location: 52
 <2><2ba>: Abbrev Number: 1 (DW_TAG_member)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x5e78b): AHB3ENR
    <2bf>   DW_AT_decl_file   : 5
    <2c0>   DW_AT_decl_line   : 565
    <2c2>   DW_AT_decl_column : 17
    <2c3>   DW_AT_type        : <0xb8>
    <2c7>   DW_AT_data_member_location: 56
 <2><2c8>: Abbrev Number: 1 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0xc8dfd): RESERVED2
    <2cd>   DW_AT_decl_file   : 5
    <2ce>   DW_AT_decl_line   : 566
    <2d0>   DW_AT_decl_column : 17
    <2d1>   DW_AT_type        : <0xac>
    <2d5>   DW_AT_data_member_location: 60
 <2><2d6>: Abbrev Number: 1 (DW_TAG_member)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x7975c): APB1ENR
    <2db>   DW_AT_decl_file   : 5
    <2dc>   DW_AT_decl_line   : 567
    <2de>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0xb8>
    <2e3>   DW_AT_data_member_location: 64
 <2><2e4>: Abbrev Number: 1 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x1a3dc): APB2ENR
    <2e9>   DW_AT_decl_file   : 5
    <2ea>   DW_AT_decl_line   : 568
    <2ec>   DW_AT_decl_column : 17
    <2ed>   DW_AT_type        : <0xb8>
    <2f1>   DW_AT_data_member_location: 68
 <2><2f2>: Abbrev Number: 1 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0xc8e07): RESERVED3
    <2f7>   DW_AT_decl_file   : 5
    <2f8>   DW_AT_decl_line   : 569
    <2fa>   DW_AT_decl_column : 17
    <2fb>   DW_AT_type        : <0xbd>
    <2ff>   DW_AT_data_member_location: 72
 <2><300>: Abbrev Number: 1 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0xadaa2): AHB1LPENR
    <305>   DW_AT_decl_file   : 5
    <306>   DW_AT_decl_line   : 570
    <308>   DW_AT_decl_column : 17
    <309>   DW_AT_type        : <0xb8>
    <30d>   DW_AT_data_member_location: 80
 <2><30e>: Abbrev Number: 1 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x2faa5): AHB2LPENR
    <313>   DW_AT_decl_file   : 5
    <314>   DW_AT_decl_line   : 571
    <316>   DW_AT_decl_column : 17
    <317>   DW_AT_type        : <0xb8>
    <31b>   DW_AT_data_member_location: 84
 <2><31c>: Abbrev Number: 1 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x8fa11): AHB3LPENR
    <321>   DW_AT_decl_file   : 5
    <322>   DW_AT_decl_line   : 572
    <324>   DW_AT_decl_column : 17
    <325>   DW_AT_type        : <0xb8>
    <329>   DW_AT_data_member_location: 88
 <2><32a>: Abbrev Number: 1 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0xc8e11): RESERVED4
    <32f>   DW_AT_decl_file   : 5
    <330>   DW_AT_decl_line   : 573
    <332>   DW_AT_decl_column : 17
    <333>   DW_AT_type        : <0xac>
    <337>   DW_AT_data_member_location: 92
 <2><338>: Abbrev Number: 1 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0xb2d04): APB1LPENR
    <33d>   DW_AT_decl_file   : 5
    <33e>   DW_AT_decl_line   : 574
    <340>   DW_AT_decl_column : 17
    <341>   DW_AT_type        : <0xb8>
    <345>   DW_AT_data_member_location: 96
 <2><346>: Abbrev Number: 1 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x23a85): APB2LPENR
    <34b>   DW_AT_decl_file   : 5
    <34c>   DW_AT_decl_line   : 575
    <34e>   DW_AT_decl_column : 17
    <34f>   DW_AT_type        : <0xb8>
    <353>   DW_AT_data_member_location: 100
 <2><354>: Abbrev Number: 1 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xc8e1b): RESERVED5
    <359>   DW_AT_decl_file   : 5
    <35a>   DW_AT_decl_line   : 576
    <35c>   DW_AT_decl_column : 17
    <35d>   DW_AT_type        : <0xbd>
    <361>   DW_AT_data_member_location: 104
 <2><362>: Abbrev Number: 1 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x50513): BDCR
    <367>   DW_AT_decl_file   : 5
    <368>   DW_AT_decl_line   : 577
    <36a>   DW_AT_decl_column : 17
    <36b>   DW_AT_type        : <0xb8>
    <36f>   DW_AT_data_member_location: 112
 <2><370>: Abbrev Number: 5 (DW_TAG_member)
    <371>   DW_AT_name        : CSR
    <375>   DW_AT_decl_file   : 5
    <375>   DW_AT_decl_line   : 578
    <377>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0xb8>
    <37b>   DW_AT_data_member_location: 116
 <2><37c>: Abbrev Number: 1 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x7e4cc): RESERVED6
    <381>   DW_AT_decl_file   : 5
    <382>   DW_AT_decl_line   : 579
    <384>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xbd>
    <389>   DW_AT_data_member_location: 120
 <2><38a>: Abbrev Number: 1 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x70050): SSCGR
    <38f>   DW_AT_decl_file   : 5
    <390>   DW_AT_decl_line   : 580
    <392>   DW_AT_decl_column : 17
    <393>   DW_AT_type        : <0xb8>
    <397>   DW_AT_data_member_location: 128
 <2><398>: Abbrev Number: 1 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x465e2): PLLI2SCFGR
    <39d>   DW_AT_decl_file   : 5
    <39e>   DW_AT_decl_line   : 581
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0xb8>
    <3a5>   DW_AT_data_member_location: 132
 <2><3a6>: Abbrev Number: 1 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0xc141c): PLLSAICFGR
    <3ab>   DW_AT_decl_file   : 5
    <3ac>   DW_AT_decl_line   : 582
    <3ae>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0xb8>
    <3b3>   DW_AT_data_member_location: 136
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x5b996): DCKCFGR
    <3b9>   DW_AT_decl_file   : 5
    <3ba>   DW_AT_decl_line   : 583
    <3bc>   DW_AT_decl_column : 17
    <3bd>   DW_AT_type        : <0xb8>
    <3c1>   DW_AT_data_member_location: 140
 <2><3c2>: Abbrev Number: 1 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0xa3729): CKGATENR
    <3c7>   DW_AT_decl_file   : 5
    <3c8>   DW_AT_decl_line   : 584
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0xb8>
    <3cf>   DW_AT_data_member_location: 144
 <2><3d0>: Abbrev Number: 1 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x93509): DCKCFGR2
    <3d5>   DW_AT_decl_file   : 5
    <3d6>   DW_AT_decl_line   : 585
    <3d8>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xb8>
    <3dd>   DW_AT_data_member_location: 148
 <2><3de>: Abbrev Number: 0
 <1><3df>: Abbrev Number: 10 (DW_TAG_typedef)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x6185e): RCC_TypeDef
    <3e4>   DW_AT_decl_file   : 5
    <3e5>   DW_AT_decl_line   : 586
    <3e7>   DW_AT_decl_column : 3
    <3e7>   DW_AT_type        : <0x200>
 <1><3eb>: Abbrev Number: 13 (DW_TAG_structure_type)
    <3ec>   DW_AT_byte_size   : 84
    <3ed>   DW_AT_decl_file   : 5
    <3ee>   DW_AT_decl_line   : 745
    <3f0>   DW_AT_decl_column : 9
    <3f0>   DW_AT_sibling     : <0x505>
 <2><3f4>: Abbrev Number: 5 (DW_TAG_member)
    <3f5>   DW_AT_name        : CR1
    <3f9>   DW_AT_decl_file   : 5
    <3f9>   DW_AT_decl_line   : 747
    <3fb>   DW_AT_decl_column : 17
    <3fb>   DW_AT_type        : <0xb8>
    <3ff>   DW_AT_data_member_location: 0
 <2><400>: Abbrev Number: 5 (DW_TAG_member)
    <401>   DW_AT_name        : CR2
    <405>   DW_AT_decl_file   : 5
    <405>   DW_AT_decl_line   : 748
    <407>   DW_AT_decl_column : 17
    <407>   DW_AT_type        : <0xb8>
    <40b>   DW_AT_data_member_location: 4
 <2><40c>: Abbrev Number: 1 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x3e3c7): SMCR
    <411>   DW_AT_decl_file   : 5
    <412>   DW_AT_decl_line   : 749
    <414>   DW_AT_decl_column : 17
    <415>   DW_AT_type        : <0xb8>
    <419>   DW_AT_data_member_location: 8
 <2><41a>: Abbrev Number: 1 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x44934): DIER
    <41f>   DW_AT_decl_file   : 5
    <420>   DW_AT_decl_line   : 750
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0xb8>
    <427>   DW_AT_data_member_location: 12
 <2><428>: Abbrev Number: 5 (DW_TAG_member)
    <429>   DW_AT_name        : SR
    <42c>   DW_AT_decl_file   : 5
    <42c>   DW_AT_decl_line   : 751
    <42e>   DW_AT_decl_column : 17
    <42e>   DW_AT_type        : <0xb8>
    <432>   DW_AT_data_member_location: 16
 <2><433>: Abbrev Number: 5 (DW_TAG_member)
    <434>   DW_AT_name        : EGR
    <438>   DW_AT_decl_file   : 5
    <438>   DW_AT_decl_line   : 752
    <43a>   DW_AT_decl_column : 17
    <43a>   DW_AT_type        : <0xb8>
    <43e>   DW_AT_data_member_location: 20
 <2><43f>: Abbrev Number: 1 (DW_TAG_member)
    <440>   DW_AT_name        : (indirect string, offset: 0xc2196): CCMR1
    <444>   DW_AT_decl_file   : 5
    <445>   DW_AT_decl_line   : 753
    <447>   DW_AT_decl_column : 17
    <448>   DW_AT_type        : <0xb8>
    <44c>   DW_AT_data_member_location: 24
 <2><44d>: Abbrev Number: 1 (DW_TAG_member)
    <44e>   DW_AT_name        : (indirect string, offset: 0x53f7b): CCMR2
    <452>   DW_AT_decl_file   : 5
    <453>   DW_AT_decl_line   : 754
    <455>   DW_AT_decl_column : 17
    <456>   DW_AT_type        : <0xb8>
    <45a>   DW_AT_data_member_location: 28
 <2><45b>: Abbrev Number: 1 (DW_TAG_member)
    <45c>   DW_AT_name        : (indirect string, offset: 0x33b7d): CCER
    <460>   DW_AT_decl_file   : 5
    <461>   DW_AT_decl_line   : 755
    <463>   DW_AT_decl_column : 17
    <464>   DW_AT_type        : <0xb8>
    <468>   DW_AT_data_member_location: 32
 <2><469>: Abbrev Number: 5 (DW_TAG_member)
    <46a>   DW_AT_name        : CNT
    <46e>   DW_AT_decl_file   : 5
    <46e>   DW_AT_decl_line   : 756
    <470>   DW_AT_decl_column : 17
    <470>   DW_AT_type        : <0xb8>
    <474>   DW_AT_data_member_location: 36
 <2><475>: Abbrev Number: 5 (DW_TAG_member)
    <476>   DW_AT_name        : PSC
    <47a>   DW_AT_decl_file   : 5
    <47a>   DW_AT_decl_line   : 757
    <47c>   DW_AT_decl_column : 17
    <47c>   DW_AT_type        : <0xb8>
    <480>   DW_AT_data_member_location: 40
 <2><481>: Abbrev Number: 5 (DW_TAG_member)
    <482>   DW_AT_name        : ARR
    <486>   DW_AT_decl_file   : 5
    <486>   DW_AT_decl_line   : 758
    <488>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0xb8>
    <48c>   DW_AT_data_member_location: 44
 <2><48d>: Abbrev Number: 5 (DW_TAG_member)
    <48e>   DW_AT_name        : RCR
    <492>   DW_AT_decl_file   : 5
    <492>   DW_AT_decl_line   : 759
    <494>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0xb8>
    <498>   DW_AT_data_member_location: 48
 <2><499>: Abbrev Number: 1 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x1a3d7): CCR1
    <49e>   DW_AT_decl_file   : 5
    <49f>   DW_AT_decl_line   : 760
    <4a1>   DW_AT_decl_column : 17
    <4a2>   DW_AT_type        : <0xb8>
    <4a6>   DW_AT_data_member_location: 52
 <2><4a7>: Abbrev Number: 1 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0x580d5): CCR2
    <4ac>   DW_AT_decl_file   : 5
    <4ad>   DW_AT_decl_line   : 761
    <4af>   DW_AT_decl_column : 17
    <4b0>   DW_AT_type        : <0xb8>
    <4b4>   DW_AT_data_member_location: 56
 <2><4b5>: Abbrev Number: 1 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0xa2b4d): CCR3
    <4ba>   DW_AT_decl_file   : 5
    <4bb>   DW_AT_decl_line   : 762
    <4bd>   DW_AT_decl_column : 17
    <4be>   DW_AT_type        : <0xb8>
    <4c2>   DW_AT_data_member_location: 60
 <2><4c3>: Abbrev Number: 1 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0xdd5e): CCR4
    <4c8>   DW_AT_decl_file   : 5
    <4c9>   DW_AT_decl_line   : 763
    <4cb>   DW_AT_decl_column : 17
    <4cc>   DW_AT_type        : <0xb8>
    <4d0>   DW_AT_data_member_location: 64
 <2><4d1>: Abbrev Number: 1 (DW_TAG_member)
    <4d2>   DW_AT_name        : (indirect string, offset: 0x90d01): BDTR
    <4d6>   DW_AT_decl_file   : 5
    <4d7>   DW_AT_decl_line   : 764
    <4d9>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0xb8>
    <4de>   DW_AT_data_member_location: 68
 <2><4df>: Abbrev Number: 5 (DW_TAG_member)
    <4e0>   DW_AT_name        : DCR
    <4e4>   DW_AT_decl_file   : 5
    <4e4>   DW_AT_decl_line   : 765
    <4e6>   DW_AT_decl_column : 17
    <4e6>   DW_AT_type        : <0xb8>
    <4ea>   DW_AT_data_member_location: 72
 <2><4eb>: Abbrev Number: 1 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0xb719b): DMAR
    <4f0>   DW_AT_decl_file   : 5
    <4f1>   DW_AT_decl_line   : 766
    <4f3>   DW_AT_decl_column : 17
    <4f4>   DW_AT_type        : <0xb8>
    <4f8>   DW_AT_data_member_location: 76
 <2><4f9>: Abbrev Number: 5 (DW_TAG_member)
    <4fa>   DW_AT_name        : OR
    <4fd>   DW_AT_decl_file   : 5
    <4fd>   DW_AT_decl_line   : 767
    <4ff>   DW_AT_decl_column : 17
    <4ff>   DW_AT_type        : <0xb8>
    <503>   DW_AT_data_member_location: 80
 <2><504>: Abbrev Number: 0
 <1><505>: Abbrev Number: 10 (DW_TAG_typedef)
    <506>   DW_AT_name        : (indirect string, offset: 0xc980a): TIM_TypeDef
    <50a>   DW_AT_decl_file   : 5
    <50b>   DW_AT_decl_line   : 768
    <50d>   DW_AT_decl_column : 3
    <50d>   DW_AT_type        : <0x3eb>
 <1><511>: Abbrev Number: 4 (DW_TAG_typedef)
    <512>   DW_AT_name        : (indirect string, offset: 0x9678): size_t
    <516>   DW_AT_decl_file   : 6
    <517>   DW_AT_decl_line   : 214
    <518>   DW_AT_decl_column : 23
    <519>   DW_AT_type        : <0x8d>
 <1><51d>: Abbrev Number: 12 (DW_TAG_const_type)
    <51e>   DW_AT_type        : <0x511>
 <1><522>: Abbrev Number: 9 (DW_TAG_base_type)
    <523>   DW_AT_byte_size   : 8
    <524>   DW_AT_encoding    : 4	(float)
    <525>   DW_AT_name        : (indirect string, offset: 0x1416d): long double
 <1><529>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <52a>   DW_AT_encoding    : 7	(unsigned)
    <52a>   DW_AT_byte_size   : 1
    <52a>   DW_AT_type        : <0x3d>
    <52e>   DW_AT_decl_file   : 7
    <52f>   DW_AT_decl_line   : 39
    <530>   DW_AT_decl_column : 1
    <530>   DW_AT_sibling     : <0x54d>
 <2><534>: Abbrev Number: 3 (DW_TAG_enumerator)
    <535>   DW_AT_name        : (indirect string, offset: 0x478e4): HAL_OK
    <539>   DW_AT_const_value : 0
 <2><53a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <53b>   DW_AT_name        : (indirect string, offset: 0x84b93): HAL_ERROR
    <53f>   DW_AT_const_value : 1
 <2><540>: Abbrev Number: 3 (DW_TAG_enumerator)
    <541>   DW_AT_name        : (indirect string, offset: 0x25ba5): HAL_BUSY
    <545>   DW_AT_const_value : 2
 <2><546>: Abbrev Number: 3 (DW_TAG_enumerator)
    <547>   DW_AT_name        : (indirect string, offset: 0x3e2cd): HAL_TIMEOUT
    <54b>   DW_AT_const_value : 3
 <2><54c>: Abbrev Number: 0
 <1><54d>: Abbrev Number: 4 (DW_TAG_typedef)
    <54e>   DW_AT_name        : (indirect string, offset: 0x2c3f): HAL_StatusTypeDef
    <552>   DW_AT_decl_file   : 7
    <553>   DW_AT_decl_line   : 44
    <554>   DW_AT_decl_column : 3
    <555>   DW_AT_type        : <0x529>
 <1><559>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <55a>   DW_AT_encoding    : 7	(unsigned)
    <55a>   DW_AT_byte_size   : 1
    <55a>   DW_AT_type        : <0x3d>
    <55e>   DW_AT_decl_file   : 7
    <55f>   DW_AT_decl_line   : 50
    <560>   DW_AT_decl_column : 1
    <560>   DW_AT_sibling     : <0x571>
 <2><564>: Abbrev Number: 3 (DW_TAG_enumerator)
    <565>   DW_AT_name        : (indirect string, offset: 0x9d77e): HAL_UNLOCKED
    <569>   DW_AT_const_value : 0
 <2><56a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <56b>   DW_AT_name        : (indirect string, offset: 0xd52b1): HAL_LOCKED
    <56f>   DW_AT_const_value : 1
 <2><570>: Abbrev Number: 0
 <1><571>: Abbrev Number: 4 (DW_TAG_typedef)
    <572>   DW_AT_name        : (indirect string, offset: 0x7d446): HAL_LockTypeDef
    <576>   DW_AT_decl_file   : 7
    <577>   DW_AT_decl_line   : 53
    <578>   DW_AT_decl_column : 3
    <579>   DW_AT_type        : <0x559>
 <1><57d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <57e>   DW_AT_byte_size   : 28
    <57f>   DW_AT_decl_file   : 8
    <580>   DW_AT_decl_line   : 45
    <581>   DW_AT_decl_column : 9
    <581>   DW_AT_sibling     : <0x5e1>
 <2><585>: Abbrev Number: 2 (DW_TAG_member)
    <586>   DW_AT_name        : (indirect string, offset: 0x8e6b3): PLLState
    <58a>   DW_AT_decl_file   : 8
    <58b>   DW_AT_decl_line   : 47
    <58c>   DW_AT_decl_column : 12
    <58d>   DW_AT_type        : <0xac>
    <591>   DW_AT_data_member_location: 0
 <2><592>: Abbrev Number: 2 (DW_TAG_member)
    <593>   DW_AT_name        : (indirect string, offset: 0x93711): PLLSource
    <597>   DW_AT_decl_file   : 8
    <598>   DW_AT_decl_line   : 50
    <599>   DW_AT_decl_column : 12
    <59a>   DW_AT_type        : <0xac>
    <59e>   DW_AT_data_member_location: 4
 <2><59f>: Abbrev Number: 2 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0xb068a): PLLM
    <5a4>   DW_AT_decl_file   : 8
    <5a5>   DW_AT_decl_line   : 53
    <5a6>   DW_AT_decl_column : 12
    <5a7>   DW_AT_type        : <0xac>
    <5ab>   DW_AT_data_member_location: 8
 <2><5ac>: Abbrev Number: 2 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xb068f): PLLN
    <5b1>   DW_AT_decl_file   : 8
    <5b2>   DW_AT_decl_line   : 56
    <5b3>   DW_AT_decl_column : 12
    <5b4>   DW_AT_type        : <0xac>
    <5b8>   DW_AT_data_member_location: 12
 <2><5b9>: Abbrev Number: 2 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0xb06ac): PLLP
    <5be>   DW_AT_decl_file   : 8
    <5bf>   DW_AT_decl_line   : 60
    <5c0>   DW_AT_decl_column : 12
    <5c1>   DW_AT_type        : <0xac>
    <5c5>   DW_AT_data_member_location: 16
 <2><5c6>: Abbrev Number: 2 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x4e734): PLLQ
    <5cb>   DW_AT_decl_file   : 8
    <5cc>   DW_AT_decl_line   : 63
    <5cd>   DW_AT_decl_column : 12
    <5ce>   DW_AT_type        : <0xac>
    <5d2>   DW_AT_data_member_location: 20
 <2><5d3>: Abbrev Number: 2 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x8984a): PLLR
    <5d8>   DW_AT_decl_file   : 8
    <5d9>   DW_AT_decl_line   : 68
    <5da>   DW_AT_decl_column : 12
    <5db>   DW_AT_type        : <0xac>
    <5df>   DW_AT_data_member_location: 24
 <2><5e0>: Abbrev Number: 0
 <1><5e1>: Abbrev Number: 4 (DW_TAG_typedef)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x804b3): RCC_PLLInitTypeDef
    <5e6>   DW_AT_decl_file   : 8
    <5e7>   DW_AT_decl_line   : 73
    <5e8>   DW_AT_decl_column : 3
    <5e9>   DW_AT_type        : <0x57d>
 <1><5ed>: Abbrev Number: 14 (DW_TAG_structure_type)
    <5ee>   DW_AT_byte_size   : 52
    <5ef>   DW_AT_decl_file   : 9
    <5f0>   DW_AT_decl_line   : 49
    <5f1>   DW_AT_decl_column : 9
    <5f1>   DW_AT_sibling     : <0x651>
 <2><5f5>: Abbrev Number: 2 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xad40e): OscillatorType
    <5fa>   DW_AT_decl_file   : 9
    <5fb>   DW_AT_decl_line   : 51
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xac>
    <601>   DW_AT_data_member_location: 0
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0x8ffb2): HSEState
    <607>   DW_AT_decl_file   : 9
    <608>   DW_AT_decl_line   : 54
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xac>
    <60e>   DW_AT_data_member_location: 4
 <2><60f>: Abbrev Number: 2 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x855cb): LSEState
    <614>   DW_AT_decl_file   : 9
    <615>   DW_AT_decl_line   : 57
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xac>
    <61b>   DW_AT_data_member_location: 8
 <2><61c>: Abbrev Number: 2 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x5de48): HSIState
    <621>   DW_AT_decl_file   : 9
    <622>   DW_AT_decl_line   : 60
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xac>
    <628>   DW_AT_data_member_location: 12
 <2><629>: Abbrev Number: 2 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0xb740d): HSICalibrationValue
    <62e>   DW_AT_decl_file   : 9
    <62f>   DW_AT_decl_line   : 63
    <630>   DW_AT_decl_column : 12
    <631>   DW_AT_type        : <0xac>
    <635>   DW_AT_data_member_location: 16
 <2><636>: Abbrev Number: 2 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x4a2ea): LSIState
    <63b>   DW_AT_decl_file   : 9
    <63c>   DW_AT_decl_line   : 66
    <63d>   DW_AT_decl_column : 12
    <63e>   DW_AT_type        : <0xac>
    <642>   DW_AT_data_member_location: 20
 <2><643>: Abbrev Number: 22 (DW_TAG_member)
    <644>   DW_AT_name        : PLL
    <648>   DW_AT_decl_file   : 9
    <649>   DW_AT_decl_line   : 69
    <64a>   DW_AT_decl_column : 22
    <64b>   DW_AT_type        : <0x5e1>
    <64f>   DW_AT_data_member_location: 24
 <2><650>: Abbrev Number: 0
 <1><651>: Abbrev Number: 4 (DW_TAG_typedef)
    <652>   DW_AT_name        : (indirect string, offset: 0x70698): RCC_OscInitTypeDef
    <656>   DW_AT_decl_file   : 9
    <657>   DW_AT_decl_line   : 70
    <658>   DW_AT_decl_column : 3
    <659>   DW_AT_type        : <0x5ed>
 <1><65d>: Abbrev Number: 12 (DW_TAG_const_type)
    <65e>   DW_AT_type        : <0x651>
 <1><662>: Abbrev Number: 14 (DW_TAG_structure_type)
    <663>   DW_AT_byte_size   : 20
    <664>   DW_AT_decl_file   : 9
    <665>   DW_AT_decl_line   : 75
    <666>   DW_AT_decl_column : 9
    <666>   DW_AT_sibling     : <0x6ac>
 <2><66a>: Abbrev Number: 2 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x40f3c): ClockType
    <66f>   DW_AT_decl_file   : 9
    <670>   DW_AT_decl_line   : 77
    <671>   DW_AT_decl_column : 12
    <672>   DW_AT_type        : <0xac>
    <676>   DW_AT_data_member_location: 0
 <2><677>: Abbrev Number: 2 (DW_TAG_member)
    <678>   DW_AT_name        : (indirect string, offset: 0x7fece): SYSCLKSource
    <67c>   DW_AT_decl_file   : 9
    <67d>   DW_AT_decl_line   : 80
    <67e>   DW_AT_decl_column : 12
    <67f>   DW_AT_type        : <0xac>
    <683>   DW_AT_data_member_location: 4
 <2><684>: Abbrev Number: 2 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0xb01a2): AHBCLKDivider
    <689>   DW_AT_decl_file   : 9
    <68a>   DW_AT_decl_line   : 83
    <68b>   DW_AT_decl_column : 12
    <68c>   DW_AT_type        : <0xac>
    <690>   DW_AT_data_member_location: 8
 <2><691>: Abbrev Number: 2 (DW_TAG_member)
    <692>   DW_AT_name        : (indirect string, offset: 0x886e): APB1CLKDivider
    <696>   DW_AT_decl_file   : 9
    <697>   DW_AT_decl_line   : 86
    <698>   DW_AT_decl_column : 12
    <699>   DW_AT_type        : <0xac>
    <69d>   DW_AT_data_member_location: 12
 <2><69e>: Abbrev Number: 2 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x6076a): APB2CLKDivider
    <6a3>   DW_AT_decl_file   : 9
    <6a4>   DW_AT_decl_line   : 89
    <6a5>   DW_AT_decl_column : 12
    <6a6>   DW_AT_type        : <0xac>
    <6aa>   DW_AT_data_member_location: 16
 <2><6ab>: Abbrev Number: 0
 <1><6ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x94b1c): RCC_ClkInitTypeDef
    <6b1>   DW_AT_decl_file   : 9
    <6b2>   DW_AT_decl_line   : 92
    <6b3>   DW_AT_decl_column : 3
    <6b4>   DW_AT_type        : <0x662>
 <1><6b8>: Abbrev Number: 12 (DW_TAG_const_type)
    <6b9>   DW_AT_type        : <0x6ac>
 <1><6bd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6be>   DW_AT_byte_size   : 20
    <6bf>   DW_AT_decl_file   : 10
    <6c0>   DW_AT_decl_line   : 46
    <6c1>   DW_AT_decl_column : 9
    <6c1>   DW_AT_sibling     : <0x707>
 <2><6c5>: Abbrev Number: 22 (DW_TAG_member)
    <6c6>   DW_AT_name        : Pin
    <6ca>   DW_AT_decl_file   : 10
    <6cb>   DW_AT_decl_line   : 48
    <6cc>   DW_AT_decl_column : 12
    <6cd>   DW_AT_type        : <0xac>
    <6d1>   DW_AT_data_member_location: 0
 <2><6d2>: Abbrev Number: 2 (DW_TAG_member)
    <6d3>   DW_AT_name        : (indirect string, offset: 0xd9f4f): Mode
    <6d7>   DW_AT_decl_file   : 10
    <6d8>   DW_AT_decl_line   : 51
    <6d9>   DW_AT_decl_column : 12
    <6da>   DW_AT_type        : <0xac>
    <6de>   DW_AT_data_member_location: 4
 <2><6df>: Abbrev Number: 2 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x6caf4): Pull
    <6e4>   DW_AT_decl_file   : 10
    <6e5>   DW_AT_decl_line   : 54
    <6e6>   DW_AT_decl_column : 12
    <6e7>   DW_AT_type        : <0xac>
    <6eb>   DW_AT_data_member_location: 8
 <2><6ec>: Abbrev Number: 2 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x7c5b5): Speed
    <6f1>   DW_AT_decl_file   : 10
    <6f2>   DW_AT_decl_line   : 57
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0xac>
    <6f8>   DW_AT_data_member_location: 12
 <2><6f9>: Abbrev Number: 2 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0x6072b): Alternate
    <6fe>   DW_AT_decl_file   : 10
    <6ff>   DW_AT_decl_line   : 60
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0xac>
    <705>   DW_AT_data_member_location: 16
 <2><706>: Abbrev Number: 0
 <1><707>: Abbrev Number: 4 (DW_TAG_typedef)
    <708>   DW_AT_name        : (indirect string, offset: 0xa6738): GPIO_InitTypeDef
    <70c>   DW_AT_decl_file   : 10
    <70d>   DW_AT_decl_line   : 62
    <70e>   DW_AT_decl_column : 2
    <70f>   DW_AT_type        : <0x6bd>
 <1><713>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <714>   DW_AT_encoding    : 7	(unsigned)
    <714>   DW_AT_byte_size   : 1
    <714>   DW_AT_type        : <0x3d>
    <718>   DW_AT_decl_file   : 10
    <719>   DW_AT_decl_line   : 68
    <71a>   DW_AT_decl_column : 1
    <71a>   DW_AT_sibling     : <0x72b>
 <2><71e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <71f>   DW_AT_name        : (indirect string, offset: 0x2c405): GPIO_PIN_RESET
    <723>   DW_AT_const_value : 0
 <2><724>: Abbrev Number: 3 (DW_TAG_enumerator)
    <725>   DW_AT_name        : (indirect string, offset: 0x358df): GPIO_PIN_SET
    <729>   DW_AT_const_value : 1
 <2><72a>: Abbrev Number: 0
 <1><72b>: Abbrev Number: 4 (DW_TAG_typedef)
    <72c>   DW_AT_name        : (indirect string, offset: 0xd1840): GPIO_PinState
    <730>   DW_AT_decl_file   : 10
    <731>   DW_AT_decl_line   : 71
    <732>   DW_AT_decl_column : 2
    <733>   DW_AT_type        : <0x713>
 <1><737>: Abbrev Number: 14 (DW_TAG_structure_type)
    <738>   DW_AT_byte_size   : 48
    <739>   DW_AT_decl_file   : 11
    <73a>   DW_AT_decl_line   : 48
    <73b>   DW_AT_decl_column : 9
    <73b>   DW_AT_sibling     : <0x7dc>
 <2><73f>: Abbrev Number: 2 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x6de7d): Channel
    <744>   DW_AT_decl_file   : 11
    <745>   DW_AT_decl_line   : 50
    <746>   DW_AT_decl_column : 12
    <747>   DW_AT_type        : <0xac>
    <74b>   DW_AT_data_member_location: 0
 <2><74c>: Abbrev Number: 2 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x4e381): Direction
    <751>   DW_AT_decl_file   : 11
    <752>   DW_AT_decl_line   : 53
    <753>   DW_AT_decl_column : 12
    <754>   DW_AT_type        : <0xac>
    <758>   DW_AT_data_member_location: 4
 <2><759>: Abbrev Number: 2 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0xe963): PeriphInc
    <75e>   DW_AT_decl_file   : 11
    <75f>   DW_AT_decl_line   : 57
    <760>   DW_AT_decl_column : 12
    <761>   DW_AT_type        : <0xac>
    <765>   DW_AT_data_member_location: 8
 <2><766>: Abbrev Number: 2 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x221c2): MemInc
    <76b>   DW_AT_decl_file   : 11
    <76c>   DW_AT_decl_line   : 60
    <76d>   DW_AT_decl_column : 12
    <76e>   DW_AT_type        : <0xac>
    <772>   DW_AT_data_member_location: 12
 <2><773>: Abbrev Number: 2 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0x68b2d): PeriphDataAlignment
    <778>   DW_AT_decl_file   : 11
    <779>   DW_AT_decl_line   : 63
    <77a>   DW_AT_decl_column : 12
    <77b>   DW_AT_type        : <0xac>
    <77f>   DW_AT_data_member_location: 16
 <2><780>: Abbrev Number: 2 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0xc05c3): MemDataAlignment
    <785>   DW_AT_decl_file   : 11
    <786>   DW_AT_decl_line   : 66
    <787>   DW_AT_decl_column : 12
    <788>   DW_AT_type        : <0xac>
    <78c>   DW_AT_data_member_location: 20
 <2><78d>: Abbrev Number: 2 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0xd9f4f): Mode
    <792>   DW_AT_decl_file   : 11
    <793>   DW_AT_decl_line   : 69
    <794>   DW_AT_decl_column : 12
    <795>   DW_AT_type        : <0xac>
    <799>   DW_AT_data_member_location: 24
 <2><79a>: Abbrev Number: 2 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0xd9179): Priority
    <79f>   DW_AT_decl_file   : 11
    <7a0>   DW_AT_decl_line   : 74
    <7a1>   DW_AT_decl_column : 12
    <7a2>   DW_AT_type        : <0xac>
    <7a6>   DW_AT_data_member_location: 28
 <2><7a7>: Abbrev Number: 2 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x5aaa5): FIFOMode
    <7ac>   DW_AT_decl_file   : 11
    <7ad>   DW_AT_decl_line   : 77
    <7ae>   DW_AT_decl_column : 12
    <7af>   DW_AT_type        : <0xac>
    <7b3>   DW_AT_data_member_location: 32
 <2><7b4>: Abbrev Number: 2 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xa1fc4): FIFOThreshold
    <7b9>   DW_AT_decl_file   : 11
    <7ba>   DW_AT_decl_line   : 82
    <7bb>   DW_AT_decl_column : 12
    <7bc>   DW_AT_type        : <0xac>
    <7c0>   DW_AT_data_member_location: 36
 <2><7c1>: Abbrev Number: 2 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x9ffe9): MemBurst
    <7c6>   DW_AT_decl_file   : 11
    <7c7>   DW_AT_decl_line   : 85
    <7c8>   DW_AT_decl_column : 12
    <7c9>   DW_AT_type        : <0xac>
    <7cd>   DW_AT_data_member_location: 40
 <2><7ce>: Abbrev Number: 2 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0x48a74): PeriphBurst
    <7d3>   DW_AT_decl_file   : 11
    <7d4>   DW_AT_decl_line   : 91
    <7d5>   DW_AT_decl_column : 12
    <7d6>   DW_AT_type        : <0xac>
    <7da>   DW_AT_data_member_location: 44
 <2><7db>: Abbrev Number: 0
 <1><7dc>: Abbrev Number: 4 (DW_TAG_typedef)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x39061): DMA_InitTypeDef
    <7e1>   DW_AT_decl_file   : 11
    <7e2>   DW_AT_decl_line   : 96
    <7e3>   DW_AT_decl_column : 2
    <7e4>   DW_AT_type        : <0x737>
 <1><7e8>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <7e9>   DW_AT_encoding    : 7	(unsigned)
    <7e9>   DW_AT_byte_size   : 1
    <7e9>   DW_AT_type        : <0x3d>
    <7ed>   DW_AT_decl_file   : 11
    <7ee>   DW_AT_decl_line   : 103
    <7ef>   DW_AT_decl_column : 1
    <7ef>   DW_AT_sibling     : <0x818>
 <2><7f3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x9edb5): HAL_DMA_STATE_RESET
    <7f8>   DW_AT_const_value : 0
 <2><7f9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x3a411): HAL_DMA_STATE_READY
    <7fe>   DW_AT_const_value : 1
 <2><7ff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <800>   DW_AT_name        : (indirect string, offset: 0x92fd0): HAL_DMA_STATE_BUSY
    <804>   DW_AT_const_value : 2
 <2><805>: Abbrev Number: 3 (DW_TAG_enumerator)
    <806>   DW_AT_name        : (indirect string, offset: 0xd1e03): HAL_DMA_STATE_TIMEOUT
    <80a>   DW_AT_const_value : 3
 <2><80b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <80c>   DW_AT_name        : (indirect string, offset: 0x96a62): HAL_DMA_STATE_ERROR
    <810>   DW_AT_const_value : 4
 <2><811>: Abbrev Number: 3 (DW_TAG_enumerator)
    <812>   DW_AT_name        : (indirect string, offset: 0x307e0): HAL_DMA_STATE_ABORT
    <816>   DW_AT_const_value : 5
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 4 (DW_TAG_typedef)
    <819>   DW_AT_name        : (indirect string, offset: 0xbf9f1): HAL_DMA_StateTypeDef
    <81d>   DW_AT_decl_file   : 11
    <81e>   DW_AT_decl_line   : 110
    <81f>   DW_AT_decl_column : 2
    <820>   DW_AT_type        : <0x7e8>
 <1><824>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <825>   DW_AT_type        : <0x818>
 <1><829>: Abbrev Number: 29 (DW_TAG_structure_type)
    <82a>   DW_AT_name        : (indirect string, offset: 0xb54a3): __DMA_HandleTypeDef
    <82e>   DW_AT_byte_size   : 96
    <82f>   DW_AT_decl_file   : 11
    <830>   DW_AT_decl_line   : 138
    <831>   DW_AT_decl_column : 16
    <832>   DW_AT_sibling     : <0x8ed>
 <2><836>: Abbrev Number: 2 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0xcde3a): Instance
    <83b>   DW_AT_decl_file   : 11
    <83c>   DW_AT_decl_line   : 140
    <83d>   DW_AT_decl_column : 31
    <83e>   DW_AT_type        : <0x8ed>
    <842>   DW_AT_data_member_location: 0
 <2><843>: Abbrev Number: 2 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0xd9858): Init
    <848>   DW_AT_decl_file   : 11
    <849>   DW_AT_decl_line   : 142
    <84a>   DW_AT_decl_column : 30
    <84b>   DW_AT_type        : <0x7dc>
    <84f>   DW_AT_data_member_location: 4
 <2><850>: Abbrev Number: 2 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0x97751): Lock
    <855>   DW_AT_decl_file   : 11
    <856>   DW_AT_decl_line   : 144
    <857>   DW_AT_decl_column : 30
    <858>   DW_AT_type        : <0x571>
    <85c>   DW_AT_data_member_location: 52
 <2><85d>: Abbrev Number: 2 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0x8ffb5): State
    <862>   DW_AT_decl_file   : 11
    <863>   DW_AT_decl_line   : 146
    <864>   DW_AT_decl_column : 30
    <865>   DW_AT_type        : <0x824>
    <869>   DW_AT_data_member_location: 53
 <2><86a>: Abbrev Number: 2 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0xca860): Parent
    <86f>   DW_AT_decl_file   : 11
    <870>   DW_AT_decl_line   : 148
    <871>   DW_AT_decl_column : 31
    <872>   DW_AT_type        : <0x8f2>
    <876>   DW_AT_data_member_location: 56
 <2><877>: Abbrev Number: 2 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0xd46cc): XferCpltCallback
    <87c>   DW_AT_decl_file   : 11
    <87d>   DW_AT_decl_line   : 150
    <87e>   DW_AT_decl_column : 33
    <87f>   DW_AT_type        : <0x909>
    <883>   DW_AT_data_member_location: 60
 <2><884>: Abbrev Number: 2 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0xa573b): XferHalfCpltCallback
    <889>   DW_AT_decl_file   : 11
    <88a>   DW_AT_decl_line   : 152
    <88b>   DW_AT_decl_column : 33
    <88c>   DW_AT_type        : <0x909>
    <890>   DW_AT_data_member_location: 64
 <2><891>: Abbrev Number: 2 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0xc2b8b): XferM1CpltCallback
    <896>   DW_AT_decl_file   : 11
    <897>   DW_AT_decl_line   : 154
    <898>   DW_AT_decl_column : 33
    <899>   DW_AT_type        : <0x909>
    <89d>   DW_AT_data_member_location: 68
 <2><89e>: Abbrev Number: 2 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x6543e): XferM1HalfCpltCallback
    <8a3>   DW_AT_decl_file   : 11
    <8a4>   DW_AT_decl_line   : 156
    <8a5>   DW_AT_decl_column : 33
    <8a6>   DW_AT_type        : <0x909>
    <8aa>   DW_AT_data_member_location: 72
 <2><8ab>: Abbrev Number: 2 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x1f325): XferErrorCallback
    <8b0>   DW_AT_decl_file   : 11
    <8b1>   DW_AT_decl_line   : 158
    <8b2>   DW_AT_decl_column : 33
    <8b3>   DW_AT_type        : <0x909>
    <8b7>   DW_AT_data_member_location: 76
 <2><8b8>: Abbrev Number: 2 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xc6e82): XferAbortCallback
    <8bd>   DW_AT_decl_file   : 11
    <8be>   DW_AT_decl_line   : 160
    <8bf>   DW_AT_decl_column : 33
    <8c0>   DW_AT_type        : <0x909>
    <8c4>   DW_AT_data_member_location: 80
 <2><8c5>: Abbrev Number: 2 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0xd04a1): ErrorCode
    <8ca>   DW_AT_decl_file   : 11
    <8cb>   DW_AT_decl_line   : 162
    <8cc>   DW_AT_decl_column : 30
    <8cd>   DW_AT_type        : <0xb8>
    <8d1>   DW_AT_data_member_location: 84
 <2><8d2>: Abbrev Number: 2 (DW_TAG_member)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x5e1d5): StreamBaseAddress
    <8d7>   DW_AT_decl_file   : 11
    <8d8>   DW_AT_decl_line   : 164
    <8d9>   DW_AT_decl_column : 30
    <8da>   DW_AT_type        : <0xac>
    <8de>   DW_AT_data_member_location: 88
 <2><8df>: Abbrev Number: 2 (DW_TAG_member)
    <8e0>   DW_AT_name        : (indirect string, offset: 0xb31b9): StreamIndex
    <8e4>   DW_AT_decl_file   : 11
    <8e5>   DW_AT_decl_line   : 166
    <8e6>   DW_AT_decl_column : 30
    <8e7>   DW_AT_type        : <0xac>
    <8eb>   DW_AT_data_member_location: 92
 <2><8ec>: Abbrev Number: 0
 <1><8ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8ee>   DW_AT_byte_size   : 4
    <8ee>   DW_AT_type        : <0x124>
 <1><8f2>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <8f3>   DW_AT_byte_size   : 4
 <1><8f4>: Abbrev Number: 12 (DW_TAG_const_type)
    <8f5>   DW_AT_type        : <0x8f2>
 <1><8f9>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <8fa>   DW_AT_prototyped  : 1
    <8fa>   DW_AT_sibling     : <0x904>
 <2><8fe>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <8ff>   DW_AT_type        : <0x904>
 <2><903>: Abbrev Number: 0
 <1><904>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <905>   DW_AT_byte_size   : 4
    <905>   DW_AT_type        : <0x829>
 <1><909>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <90a>   DW_AT_byte_size   : 4
    <90a>   DW_AT_type        : <0x8f9>
 <1><90e>: Abbrev Number: 4 (DW_TAG_typedef)
    <90f>   DW_AT_name        : (indirect string, offset: 0xb54a5): DMA_HandleTypeDef
    <913>   DW_AT_decl_file   : 11
    <914>   DW_AT_decl_line   : 168
    <915>   DW_AT_decl_column : 2
    <916>   DW_AT_type        : <0x829>
 <1><91a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <91b>   DW_AT_byte_size   : 24
    <91c>   DW_AT_decl_file   : 12
    <91d>   DW_AT_decl_line   : 46
    <91e>   DW_AT_decl_column : 9
    <91e>   DW_AT_sibling     : <0x971>
 <2><922>: Abbrev Number: 2 (DW_TAG_member)
    <923>   DW_AT_name        : (indirect string, offset: 0xd62f9): Prescaler
    <927>   DW_AT_decl_file   : 12
    <928>   DW_AT_decl_line   : 48
    <929>   DW_AT_decl_column : 12
    <92a>   DW_AT_type        : <0xac>
    <92e>   DW_AT_data_member_location: 0
 <2><92f>: Abbrev Number: 2 (DW_TAG_member)
    <930>   DW_AT_name        : (indirect string, offset: 0xc1378): CounterMode
    <934>   DW_AT_decl_file   : 12
    <935>   DW_AT_decl_line   : 51
    <936>   DW_AT_decl_column : 12
    <937>   DW_AT_type        : <0xac>
    <93b>   DW_AT_data_member_location: 4
 <2><93c>: Abbrev Number: 2 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0xdeb1c): Period
    <941>   DW_AT_decl_file   : 12
    <942>   DW_AT_decl_line   : 54
    <943>   DW_AT_decl_column : 12
    <944>   DW_AT_type        : <0xac>
    <948>   DW_AT_data_member_location: 8
 <2><949>: Abbrev Number: 2 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x557b8): ClockDivision
    <94e>   DW_AT_decl_file   : 12
    <94f>   DW_AT_decl_line   : 58
    <950>   DW_AT_decl_column : 12
    <951>   DW_AT_type        : <0xac>
    <955>   DW_AT_data_member_location: 12
 <2><956>: Abbrev Number: 2 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x947e2): RepetitionCounter
    <95b>   DW_AT_decl_file   : 12
    <95c>   DW_AT_decl_line   : 61
    <95d>   DW_AT_decl_column : 12
    <95e>   DW_AT_type        : <0xac>
    <962>   DW_AT_data_member_location: 16
 <2><963>: Abbrev Number: 2 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0xc477a): AutoReloadPreload
    <968>   DW_AT_decl_file   : 12
    <969>   DW_AT_decl_line   : 72
    <96a>   DW_AT_decl_column : 12
    <96b>   DW_AT_type        : <0xac>
    <96f>   DW_AT_data_member_location: 20
 <2><970>: Abbrev Number: 0
 <1><971>: Abbrev Number: 4 (DW_TAG_typedef)
    <972>   DW_AT_name        : (indirect string, offset: 0x4930f): TIM_Base_InitTypeDef
    <976>   DW_AT_decl_file   : 12
    <977>   DW_AT_decl_line   : 74
    <978>   DW_AT_decl_column : 3
    <979>   DW_AT_type        : <0x91a>
 <1><97d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <97e>   DW_AT_encoding    : 7	(unsigned)
    <97e>   DW_AT_byte_size   : 1
    <97e>   DW_AT_type        : <0x3d>
    <982>   DW_AT_decl_file   : 12
    <982>   DW_AT_decl_line   : 291
    <984>   DW_AT_decl_column : 1
    <984>   DW_AT_sibling     : <0x9a7>
 <2><988>: Abbrev Number: 3 (DW_TAG_enumerator)
    <989>   DW_AT_name        : (indirect string, offset: 0x85182): HAL_TIM_STATE_RESET
    <98d>   DW_AT_const_value : 0
 <2><98e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <98f>   DW_AT_name        : (indirect string, offset: 0x7d66): HAL_TIM_STATE_READY
    <993>   DW_AT_const_value : 1
 <2><994>: Abbrev Number: 3 (DW_TAG_enumerator)
    <995>   DW_AT_name        : (indirect string, offset: 0x358b3): HAL_TIM_STATE_BUSY
    <999>   DW_AT_const_value : 2
 <2><99a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <99b>   DW_AT_name        : (indirect string, offset: 0xb20b8): HAL_TIM_STATE_TIMEOUT
    <99f>   DW_AT_const_value : 3
 <2><9a0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x82f1e): HAL_TIM_STATE_ERROR
    <9a5>   DW_AT_const_value : 4
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 10 (DW_TAG_typedef)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x8b69e): HAL_TIM_StateTypeDef
    <9ac>   DW_AT_decl_file   : 12
    <9ad>   DW_AT_decl_line   : 297
    <9af>   DW_AT_decl_column : 3
    <9af>   DW_AT_type        : <0x97d>
 <1><9b3>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <9b4>   DW_AT_type        : <0x9a7>
 <1><9b8>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <9b9>   DW_AT_encoding    : 7	(unsigned)
    <9b9>   DW_AT_byte_size   : 1
    <9b9>   DW_AT_type        : <0x3d>
    <9bd>   DW_AT_decl_file   : 12
    <9bd>   DW_AT_decl_line   : 303
    <9bf>   DW_AT_decl_column : 1
    <9bf>   DW_AT_sibling     : <0x9d6>
 <2><9c3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c4>   DW_AT_name        : (indirect string, offset: 0x95d58): HAL_TIM_CHANNEL_STATE_RESET
    <9c8>   DW_AT_const_value : 0
 <2><9c9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x7cc58): HAL_TIM_CHANNEL_STATE_READY
    <9ce>   DW_AT_const_value : 1
 <2><9cf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9d0>   DW_AT_name        : (indirect string, offset: 0x6560a): HAL_TIM_CHANNEL_STATE_BUSY
    <9d4>   DW_AT_const_value : 2
 <2><9d5>: Abbrev Number: 0
 <1><9d6>: Abbrev Number: 10 (DW_TAG_typedef)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x2cda1): HAL_TIM_ChannelStateTypeDef
    <9db>   DW_AT_decl_file   : 12
    <9dc>   DW_AT_decl_line   : 307
    <9de>   DW_AT_decl_column : 3
    <9de>   DW_AT_type        : <0x9b8>
 <1><9e2>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <9e3>   DW_AT_type        : <0x9d6>
 <1><9e7>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <9e8>   DW_AT_encoding    : 7	(unsigned)
    <9e8>   DW_AT_byte_size   : 1
    <9e8>   DW_AT_type        : <0x3d>
    <9ec>   DW_AT_decl_file   : 12
    <9ec>   DW_AT_decl_line   : 313
    <9ee>   DW_AT_decl_column : 1
    <9ee>   DW_AT_sibling     : <0xa05>
 <2><9f2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x4a0e): HAL_DMA_BURST_STATE_RESET
    <9f7>   DW_AT_const_value : 0
 <2><9f8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x74a2e): HAL_DMA_BURST_STATE_READY
    <9fd>   DW_AT_const_value : 1
 <2><9fe>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x47821): HAL_DMA_BURST_STATE_BUSY
    <a03>   DW_AT_const_value : 2
 <2><a04>: Abbrev Number: 0
 <1><a05>: Abbrev Number: 10 (DW_TAG_typedef)
    <a06>   DW_AT_name        : (indirect string, offset: 0xc2ec5): HAL_TIM_DMABurstStateTypeDef
    <a0a>   DW_AT_decl_file   : 12
    <a0b>   DW_AT_decl_line   : 317
    <a0d>   DW_AT_decl_column : 3
    <a0d>   DW_AT_type        : <0x9e7>
 <1><a11>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a12>   DW_AT_type        : <0xa05>
 <1><a16>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <a17>   DW_AT_encoding    : 7	(unsigned)
    <a17>   DW_AT_byte_size   : 1
    <a17>   DW_AT_type        : <0x3d>
    <a1b>   DW_AT_decl_file   : 12
    <a1b>   DW_AT_decl_line   : 323
    <a1d>   DW_AT_decl_column : 1
    <a1d>   DW_AT_sibling     : <0xa40>
 <2><a21>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a22>   DW_AT_name        : (indirect string, offset: 0x76f55): HAL_TIM_ACTIVE_CHANNEL_1
    <a26>   DW_AT_const_value : 1
 <2><a27>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a28>   DW_AT_name        : (indirect string, offset: 0x76f6e): HAL_TIM_ACTIVE_CHANNEL_2
    <a2c>   DW_AT_const_value : 2
 <2><a2d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x76f87): HAL_TIM_ACTIVE_CHANNEL_3
    <a32>   DW_AT_const_value : 4
 <2><a33>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a34>   DW_AT_name        : (indirect string, offset: 0x76fa0): HAL_TIM_ACTIVE_CHANNEL_4
    <a38>   DW_AT_const_value : 8
 <2><a39>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x56919): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <a3e>   DW_AT_const_value : 0
 <2><a3f>: Abbrev Number: 0
 <1><a40>: Abbrev Number: 10 (DW_TAG_typedef)
    <a41>   DW_AT_name        : (indirect string, offset: 0x6de6f): HAL_TIM_ActiveChannel
    <a45>   DW_AT_decl_file   : 12
    <a46>   DW_AT_decl_line   : 329
    <a48>   DW_AT_decl_column : 3
    <a48>   DW_AT_type        : <0xa16>
 <1><a4c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a4d>   DW_AT_byte_size   : 72
    <a4e>   DW_AT_decl_file   : 12
    <a4f>   DW_AT_decl_line   : 337
    <a51>   DW_AT_decl_column : 9
    <a51>   DW_AT_sibling     : <0xad4>
 <2><a55>: Abbrev Number: 1 (DW_TAG_member)
    <a56>   DW_AT_name        : (indirect string, offset: 0xcde3a): Instance
    <a5a>   DW_AT_decl_file   : 12
    <a5b>   DW_AT_decl_line   : 340
    <a5d>   DW_AT_decl_column : 39
    <a5e>   DW_AT_type        : <0xad4>
    <a62>   DW_AT_data_member_location: 0
 <2><a63>: Abbrev Number: 1 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0xd9858): Init
    <a68>   DW_AT_decl_file   : 12
    <a69>   DW_AT_decl_line   : 341
    <a6b>   DW_AT_decl_column : 38
    <a6c>   DW_AT_type        : <0x971>
    <a70>   DW_AT_data_member_location: 4
 <2><a71>: Abbrev Number: 1 (DW_TAG_member)
    <a72>   DW_AT_name        : (indirect string, offset: 0x6de7d): Channel
    <a76>   DW_AT_decl_file   : 12
    <a77>   DW_AT_decl_line   : 342
    <a79>   DW_AT_decl_column : 38
    <a7a>   DW_AT_type        : <0xa40>
    <a7e>   DW_AT_data_member_location: 28
 <2><a7f>: Abbrev Number: 1 (DW_TAG_member)
    <a80>   DW_AT_name        : (indirect string, offset: 0x7f43a): hdma
    <a84>   DW_AT_decl_file   : 12
    <a85>   DW_AT_decl_line   : 343
    <a87>   DW_AT_decl_column : 39
    <a88>   DW_AT_type        : <0xad9>
    <a8c>   DW_AT_data_member_location: 32
 <2><a8d>: Abbrev Number: 1 (DW_TAG_member)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x97751): Lock
    <a92>   DW_AT_decl_file   : 12
    <a93>   DW_AT_decl_line   : 345
    <a95>   DW_AT_decl_column : 38
    <a96>   DW_AT_type        : <0x571>
    <a9a>   DW_AT_data_member_location: 60
 <2><a9b>: Abbrev Number: 1 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x8ffb5): State
    <aa0>   DW_AT_decl_file   : 12
    <aa1>   DW_AT_decl_line   : 346
    <aa3>   DW_AT_decl_column : 38
    <aa4>   DW_AT_type        : <0x9b3>
    <aa8>   DW_AT_data_member_location: 61
 <2><aa9>: Abbrev Number: 1 (DW_TAG_member)
    <aaa>   DW_AT_name        : (indirect string, offset: 0xda614): ChannelState
    <aae>   DW_AT_decl_file   : 12
    <aaf>   DW_AT_decl_line   : 347
    <ab1>   DW_AT_decl_column : 38
    <ab2>   DW_AT_type        : <0xafe>
    <ab6>   DW_AT_data_member_location: 62
 <2><ab7>: Abbrev Number: 1 (DW_TAG_member)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xdac7d): ChannelNState
    <abc>   DW_AT_decl_file   : 12
    <abd>   DW_AT_decl_line   : 348
    <abf>   DW_AT_decl_column : 38
    <ac0>   DW_AT_type        : <0xafe>
    <ac4>   DW_AT_data_member_location: 66
 <2><ac5>: Abbrev Number: 1 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0xda166): DMABurstState
    <aca>   DW_AT_decl_file   : 12
    <acb>   DW_AT_decl_line   : 349
    <acd>   DW_AT_decl_column : 38
    <ace>   DW_AT_type        : <0xa11>
    <ad2>   DW_AT_data_member_location: 70
 <2><ad3>: Abbrev Number: 0
 <1><ad4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ad5>   DW_AT_byte_size   : 4
    <ad5>   DW_AT_type        : <0x505>
 <1><ad9>: Abbrev Number: 15 (DW_TAG_array_type)
    <ada>   DW_AT_type        : <0xae9>
    <ade>   DW_AT_sibling     : <0xae9>
 <2><ae2>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <ae3>   DW_AT_type        : <0x8d>
    <ae7>   DW_AT_upper_bound : 6
 <2><ae8>: Abbrev Number: 0
 <1><ae9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <aea>   DW_AT_byte_size   : 4
    <aea>   DW_AT_type        : <0x90e>
 <1><aee>: Abbrev Number: 15 (DW_TAG_array_type)
    <aef>   DW_AT_type        : <0x9e2>
    <af3>   DW_AT_sibling     : <0xafe>
 <2><af7>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <af8>   DW_AT_type        : <0x8d>
    <afc>   DW_AT_upper_bound : 3
 <2><afd>: Abbrev Number: 0
 <1><afe>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <aff>   DW_AT_type        : <0xaee>
 <1><b03>: Abbrev Number: 10 (DW_TAG_typedef)
    <b04>   DW_AT_name        : (indirect string, offset: 0x48d5b): TIM_HandleTypeDef
    <b08>   DW_AT_decl_file   : 12
    <b09>   DW_AT_decl_line   : 380
    <b0b>   DW_AT_decl_column : 3
    <b0b>   DW_AT_type        : <0xa4c>
 <1><b0f>: Abbrev Number: 9 (DW_TAG_base_type)
    <b10>   DW_AT_byte_size   : 1
    <b11>   DW_AT_encoding    : 8	(unsigned char)
    <b12>   DW_AT_name        : (indirect string, offset: 0x44b75): char
 <1><b16>: Abbrev Number: 12 (DW_TAG_const_type)
    <b17>   DW_AT_type        : <0xb0f>
 <1><b1b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b1c>   DW_AT_byte_size   : 4
    <b1c>   DW_AT_type        : <0xb16>
 <1><b20>: Abbrev Number: 12 (DW_TAG_const_type)
    <b21>   DW_AT_type        : <0xb1b>
 <1><b25>: Abbrev Number: 4 (DW_TAG_typedef)
    <b26>   DW_AT_name        : (indirect string, offset: 0x63a17): TaskFunction_t
    <b2a>   DW_AT_decl_file   : 13
    <b2b>   DW_AT_decl_line   : 36
    <b2c>   DW_AT_decl_column : 17
    <b2d>   DW_AT_type        : <0xb31>
 <1><b31>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b32>   DW_AT_byte_size   : 4
    <b32>   DW_AT_type        : <0xb36>
 <1><b36>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <b37>   DW_AT_prototyped  : 1
    <b37>   DW_AT_sibling     : <0xb41>
 <2><b3b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b3c>   DW_AT_type        : <0x8f2>
 <2><b40>: Abbrev Number: 0
 <1><b41>: Abbrev Number: 4 (DW_TAG_typedef)
    <b42>   DW_AT_name        : (indirect string, offset: 0x1bf7): BaseType_t
    <b46>   DW_AT_decl_file   : 14
    <b47>   DW_AT_decl_line   : 59
    <b48>   DW_AT_decl_column : 26
    <b49>   DW_AT_type        : <0x5e>
 <1><b4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x1bf6): UBaseType_t
    <b52>   DW_AT_decl_file   : 14
    <b53>   DW_AT_decl_line   : 60
    <b54>   DW_AT_decl_column : 26
    <b55>   DW_AT_type        : <0x71>
 <1><b59>: Abbrev Number: 4 (DW_TAG_typedef)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x558e1): TaskHandle_t
    <b5e>   DW_AT_decl_file   : 15
    <b5f>   DW_AT_decl_line   : 99
    <b60>   DW_AT_decl_column : 46
    <b61>   DW_AT_type        : <0xb65>
 <1><b65>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b66>   DW_AT_byte_size   : 4
    <b66>   DW_AT_type        : <0xb6a>
 <1><b6a>: Abbrev Number: 31 (DW_TAG_structure_type)
    <b6b>   DW_AT_name        : (indirect string, offset: 0xb5103): tskTaskControlBlock
    <b6f>   DW_AT_declaration : 1
 <1><b6f>: Abbrev Number: 32 (DW_TAG_subprogram)
    <b70>   DW_AT_external    : 1
    <b70>   DW_AT_name        : (indirect string, offset: 0x47fab): HAL_IncTick
    <b74>   DW_AT_decl_file   : 16
    <b75>   DW_AT_decl_line   : 232
    <b76>   DW_AT_decl_column : 6
    <b77>   DW_AT_prototyped  : 1
    <b77>   DW_AT_declaration : 1
 <1><b77>: Abbrev Number: 24 (DW_TAG_subprogram)
    <b78>   DW_AT_external    : 1
    <b78>   DW_AT_name        : (indirect string, offset: 0x826c7): HAL_GPIO_Init
    <b7c>   DW_AT_decl_file   : 10
    <b7c>   DW_AT_decl_line   : 224
    <b7d>   DW_AT_decl_column : 7
    <b7e>   DW_AT_prototyped  : 1
    <b7e>   DW_AT_declaration : 1
    <b7e>   DW_AT_sibling     : <0xb8d>
 <2><b82>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b83>   DW_AT_type        : <0xb8d>
 <2><b87>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b88>   DW_AT_type        : <0xb92>
 <2><b8c>: Abbrev Number: 0
 <1><b8d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b8e>   DW_AT_byte_size   : 4
    <b8e>   DW_AT_type        : <0x1c7>
 <1><b92>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b93>   DW_AT_byte_size   : 4
    <b93>   DW_AT_type        : <0x707>
 <1><b97>: Abbrev Number: 24 (DW_TAG_subprogram)
    <b98>   DW_AT_external    : 1
    <b98>   DW_AT_name        : (indirect string, offset: 0x2642a): HAL_GPIO_WritePin
    <b9c>   DW_AT_decl_file   : 10
    <b9c>   DW_AT_decl_line   : 235
    <b9d>   DW_AT_decl_column : 6
    <b9e>   DW_AT_prototyped  : 1
    <b9e>   DW_AT_declaration : 1
    <b9e>   DW_AT_sibling     : <0xbb2>
 <2><ba2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ba3>   DW_AT_type        : <0xb8d>
 <2><ba7>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ba8>   DW_AT_type        : <0xa0>
 <2><bac>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bad>   DW_AT_type        : <0x72b>
 <2><bb1>: Abbrev Number: 0
 <1><bb2>: Abbrev Number: 20 (DW_TAG_subprogram)
    <bb3>   DW_AT_external    : 1
    <bb3>   DW_AT_name        : (indirect string, offset: 0xb68c8): HAL_RCC_ClockConfig
    <bb7>   DW_AT_decl_file   : 9
    <bb8>   DW_AT_decl_line   : 1246
    <bba>   DW_AT_decl_column : 19
    <bbb>   DW_AT_prototyped  : 1
    <bbb>   DW_AT_type        : <0x54d>
    <bbf>   DW_AT_declaration : 1
    <bbf>   DW_AT_sibling     : <0xbce>
 <2><bc3>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bc4>   DW_AT_type        : <0xbce>
 <2><bc8>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bc9>   DW_AT_type        : <0xac>
 <2><bcd>: Abbrev Number: 0
 <1><bce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bcf>   DW_AT_byte_size   : 4
    <bcf>   DW_AT_type        : <0x6b8>
 <1><bd3>: Abbrev Number: 20 (DW_TAG_subprogram)
    <bd4>   DW_AT_external    : 1
    <bd4>   DW_AT_name        : (indirect string, offset: 0x92886): HAL_RCC_OscConfig
    <bd8>   DW_AT_decl_file   : 9
    <bd9>   DW_AT_decl_line   : 1245
    <bdb>   DW_AT_decl_column : 19
    <bdc>   DW_AT_prototyped  : 1
    <bdc>   DW_AT_type        : <0x54d>
    <be0>   DW_AT_declaration : 1
    <be0>   DW_AT_sibling     : <0xbea>
 <2><be4>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <be5>   DW_AT_type        : <0xbea>
 <2><be9>: Abbrev Number: 0
 <1><bea>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <beb>   DW_AT_byte_size   : 4
    <beb>   DW_AT_type        : <0x65d>
 <1><bef>: Abbrev Number: 33 (DW_TAG_subprogram)
    <bf0>   DW_AT_external    : 1
    <bf0>   DW_AT_name        : (indirect string, offset: 0xaab0a): vTaskStartScheduler
    <bf4>   DW_AT_decl_file   : 15
    <bf5>   DW_AT_decl_line   : 1524
    <bf7>   DW_AT_decl_column : 6
    <bf8>   DW_AT_prototyped  : 1
    <bf8>   DW_AT_declaration : 1
 <1><bf8>: Abbrev Number: 20 (DW_TAG_subprogram)
    <bf9>   DW_AT_external    : 1
    <bf9>   DW_AT_name        : (indirect string, offset: 0x7fe25): xTaskCreate
    <bfd>   DW_AT_decl_file   : 15
    <bfe>   DW_AT_decl_line   : 389
    <c00>   DW_AT_decl_column : 16
    <c01>   DW_AT_prototyped  : 1
    <c01>   DW_AT_type        : <0xb41>
    <c05>   DW_AT_declaration : 1
    <c05>   DW_AT_sibling     : <0xc28>
 <2><c09>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c0a>   DW_AT_type        : <0xb25>
 <2><c0e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c0f>   DW_AT_type        : <0xb20>
 <2><c13>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c14>   DW_AT_type        : <0x51d>
 <2><c18>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c19>   DW_AT_type        : <0x8f4>
 <2><c1d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c1e>   DW_AT_type        : <0xb4d>
 <2><c22>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c23>   DW_AT_type        : <0xc2d>
 <2><c27>: Abbrev Number: 0
 <1><c28>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c29>   DW_AT_byte_size   : 4
    <c29>   DW_AT_type        : <0xb59>
 <1><c2d>: Abbrev Number: 12 (DW_TAG_const_type)
    <c2e>   DW_AT_type        : <0xc28>
 <1><c32>: Abbrev Number: 34 (DW_TAG_subprogram)
    <c33>   DW_AT_external    : 1
    <c33>   DW_AT_name        : (indirect string, offset: 0xc79ca): HAL_Init
    <c37>   DW_AT_decl_file   : 16
    <c38>   DW_AT_decl_line   : 219
    <c39>   DW_AT_decl_column : 19
    <c3a>   DW_AT_prototyped  : 1
    <c3a>   DW_AT_type        : <0x54d>
    <c3e>   DW_AT_declaration : 1
 <1><c3e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <c3f>   DW_AT_external    : 1
    <c3f>   DW_AT_name        : (indirect string, offset: 0x7dc3): printf
    <c43>   DW_AT_decl_file   : 17
    <c44>   DW_AT_decl_line   : 206
    <c45>   DW_AT_decl_column : 5
    <c46>   DW_AT_prototyped  : 1
    <c46>   DW_AT_type        : <0x86>
    <c4a>   DW_AT_declaration : 1
    <c4a>   DW_AT_sibling     : <0xc55>
 <2><c4e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c4f>   DW_AT_type        : <0xb1b>
 <2><c53>: Abbrev Number: 36 (DW_TAG_unspecified_parameters)
 <2><c54>: Abbrev Number: 0
 <1><c55>: Abbrev Number: 37 (DW_TAG_subprogram)
    <c56>   DW_AT_external    : 1
    <c56>   DW_AT_name        : (indirect string, offset: 0x5d2ff): Error_Handler
    <c5a>   DW_AT_decl_file   : 1
    <c5b>   DW_AT_decl_line   : 283
    <c5d>   DW_AT_decl_column : 6
    <c5e>   DW_AT_prototyped  : 1
    <c5e>   DW_AT_low_pc      : 0x800089c
    <c62>   DW_AT_high_pc     : 0xc
    <c66>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c68>   DW_AT_call_all_calls: 1
    <c68>   DW_AT_sibling     : <0xc7e>
 <2><c6c>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <c6d>   DW_AT_abstract_origin: <0xe2d>
    <c71>   DW_AT_low_pc      : 0x80008a0
    <c75>   DW_AT_high_pc     : 0x4
    <c79>   DW_AT_call_file   : 1
    <c7a>   DW_AT_call_line   : 287
    <c7c>   DW_AT_call_column : 3
 <2><c7d>: Abbrev Number: 0
 <1><c7e>: Abbrev Number: 39 (DW_TAG_subprogram)
    <c7f>   DW_AT_external    : 1
    <c7f>   DW_AT_name        : (indirect string, offset: 0xb274c): HAL_TIM_PeriodElapsedCallback
    <c83>   DW_AT_decl_file   : 1
    <c84>   DW_AT_decl_line   : 265
    <c86>   DW_AT_decl_column : 6
    <c87>   DW_AT_prototyped  : 1
    <c87>   DW_AT_low_pc      : 0x8000878
    <c8b>   DW_AT_high_pc     : 0x24
    <c8f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c91>   DW_AT_call_all_tail_calls: 1
    <c91>   DW_AT_sibling     : <0xca6>
 <2><c95>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <c96>   DW_AT_name        : (indirect string, offset: 0xa714d): htim
    <c9a>   DW_AT_decl_file   : 1
    <c9b>   DW_AT_decl_line   : 265
    <c9d>   DW_AT_decl_column : 55
    <c9e>   DW_AT_type        : <0xca6>
    <ca2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ca5>: Abbrev Number: 0
 <1><ca6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ca7>   DW_AT_byte_size   : 4
    <ca7>   DW_AT_type        : <0xb03>
 <1><cab>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cac>   DW_AT_name        : (indirect string, offset: 0xa4b1a): task2_handler
    <cb0>   DW_AT_decl_file   : 1
    <cb0>   DW_AT_decl_line   : 245
    <cb1>   DW_AT_decl_column : 13
    <cb1>   DW_AT_prototyped  : 1
    <cb1>   DW_AT_low_pc      : 0x800084c
    <cb5>   DW_AT_high_pc     : 0x2c
    <cb9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cbb>   DW_AT_call_all_tail_calls: 1
    <cbb>   DW_AT_sibling     : <0xccd>
 <2><cbf>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x380ba): parameters
    <cc4>   DW_AT_decl_file   : 1
    <cc4>   DW_AT_decl_line   : 245
    <cc5>   DW_AT_decl_column : 34
    <cc5>   DW_AT_type        : <0x8f2>
    <cc9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ccc>: Abbrev Number: 0
 <1><ccd>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cce>   DW_AT_name        : (indirect string, offset: 0x41d9c): task1_handler
    <cd2>   DW_AT_decl_file   : 1
    <cd2>   DW_AT_decl_line   : 233
    <cd3>   DW_AT_decl_column : 13
    <cd3>   DW_AT_prototyped  : 1
    <cd3>   DW_AT_low_pc      : 0x8000820
    <cd7>   DW_AT_high_pc     : 0x2c
    <cdb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cdd>   DW_AT_call_all_tail_calls: 1
    <cdd>   DW_AT_sibling     : <0xcef>
 <2><ce1>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x380ba): parameters
    <ce6>   DW_AT_decl_file   : 1
    <ce6>   DW_AT_decl_line   : 233
    <ce7>   DW_AT_decl_column : 34
    <ce7>   DW_AT_type        : <0x8f2>
    <ceb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cee>: Abbrev Number: 0
 <1><cef>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x55e11): MX_GPIO_Init
    <cf4>   DW_AT_decl_file   : 1
    <cf4>   DW_AT_decl_line   : 190
    <cf5>   DW_AT_decl_column : 13
    <cf5>   DW_AT_prototyped  : 1
    <cf5>   DW_AT_low_pc      : 0x8000724
    <cf9>   DW_AT_high_pc     : 0xfc
    <cfd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cff>   DW_AT_call_all_tail_calls: 1
    <cff>   DW_AT_sibling     : <0xd7e>
 <2><d03>: Abbrev Number: 8 (DW_TAG_variable)
    <d04>   DW_AT_name        : (indirect string, offset: 0x14e96): GPIO_InitStruct
    <d08>   DW_AT_decl_file   : 1
    <d08>   DW_AT_decl_line   : 192
    <d09>   DW_AT_decl_column : 20
    <d0a>   DW_AT_type        : <0x707>
    <d0e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><d11>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <d12>   DW_AT_low_pc      : 0x800073a
    <d16>   DW_AT_high_pc     : 0x1c
    <d1a>   DW_AT_sibling     : <0xd2d>
 <3><d1e>: Abbrev Number: 8 (DW_TAG_variable)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x1c46): tmpreg
    <d23>   DW_AT_decl_file   : 1
    <d23>   DW_AT_decl_line   : 198
    <d24>   DW_AT_decl_column : 3
    <d25>   DW_AT_type        : <0xb8>
    <d29>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><d2c>: Abbrev Number: 0
 <2><d2d>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <d2e>   DW_AT_low_pc      : 0x8000756
    <d32>   DW_AT_high_pc     : 0x1c
    <d36>   DW_AT_sibling     : <0xd49>
 <3><d3a>: Abbrev Number: 8 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x1c46): tmpreg
    <d3f>   DW_AT_decl_file   : 1
    <d3f>   DW_AT_decl_line   : 199
    <d40>   DW_AT_decl_column : 3
    <d41>   DW_AT_type        : <0xb8>
    <d45>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><d48>: Abbrev Number: 0
 <2><d49>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <d4a>   DW_AT_low_pc      : 0x8000772
    <d4e>   DW_AT_high_pc     : 0x1c
    <d52>   DW_AT_sibling     : <0xd65>
 <3><d56>: Abbrev Number: 8 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0x1c46): tmpreg
    <d5b>   DW_AT_decl_file   : 1
    <d5b>   DW_AT_decl_line   : 200
    <d5c>   DW_AT_decl_column : 3
    <d5d>   DW_AT_type        : <0xb8>
    <d61>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><d64>: Abbrev Number: 0
 <2><d65>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <d66>   DW_AT_low_pc      : 0x800078e
    <d6a>   DW_AT_high_pc     : 0x1c
 <3><d6e>: Abbrev Number: 8 (DW_TAG_variable)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x1c46): tmpreg
    <d73>   DW_AT_decl_file   : 1
    <d73>   DW_AT_decl_line   : 201
    <d74>   DW_AT_decl_column : 3
    <d75>   DW_AT_type        : <0xb8>
    <d79>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><d7c>: Abbrev Number: 0
 <2><d7d>: Abbrev Number: 0
 <1><d7e>: Abbrev Number: 41 (DW_TAG_subprogram)
    <d7f>   DW_AT_external    : 1
    <d7f>   DW_AT_name        : (indirect string, offset: 0x92e79): SystemClock_Config
    <d83>   DW_AT_decl_file   : 1
    <d84>   DW_AT_decl_line   : 142
    <d85>   DW_AT_decl_column : 6
    <d86>   DW_AT_prototyped  : 1
    <d86>   DW_AT_low_pc      : 0x8000648
    <d8a>   DW_AT_high_pc     : 0xdc
    <d8e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d90>   DW_AT_call_all_tail_calls: 1
    <d90>   DW_AT_sibling     : <0xde8>
 <2><d94>: Abbrev Number: 8 (DW_TAG_variable)
    <d95>   DW_AT_name        : (indirect string, offset: 0x2e825): RCC_OscInitStruct
    <d99>   DW_AT_decl_file   : 1
    <d99>   DW_AT_decl_line   : 144
    <d9a>   DW_AT_decl_column : 22
    <d9b>   DW_AT_type        : <0x651>
    <d9f>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><da2>: Abbrev Number: 8 (DW_TAG_variable)
    <da3>   DW_AT_name        : (indirect string, offset: 0x4fa05): RCC_ClkInitStruct
    <da7>   DW_AT_decl_file   : 1
    <da7>   DW_AT_decl_line   : 145
    <da8>   DW_AT_decl_column : 22
    <da9>   DW_AT_type        : <0x6ac>
    <dad>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><db1>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <db2>   DW_AT_low_pc      : 0x800066c
    <db6>   DW_AT_high_pc     : 0x1c
    <dba>   DW_AT_sibling     : <0xdce>
 <3><dbe>: Abbrev Number: 8 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x1c46): tmpreg
    <dc3>   DW_AT_decl_file   : 1
    <dc3>   DW_AT_decl_line   : 149
    <dc4>   DW_AT_decl_column : 3
    <dc5>   DW_AT_type        : <0xb8>
    <dc9>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><dcd>: Abbrev Number: 0
 <2><dce>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <dcf>   DW_AT_low_pc      : 0x8000688
    <dd3>   DW_AT_high_pc     : 0x20
 <3><dd7>: Abbrev Number: 8 (DW_TAG_variable)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x1c46): tmpreg
    <ddc>   DW_AT_decl_file   : 1
    <ddc>   DW_AT_decl_line   : 150
    <ddd>   DW_AT_decl_column : 3
    <dde>   DW_AT_type        : <0xb8>
    <de2>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><de6>: Abbrev Number: 0
 <2><de7>: Abbrev Number: 0
 <1><de8>: Abbrev Number: 42 (DW_TAG_subprogram)
    <de9>   DW_AT_external    : 1
    <de9>   DW_AT_name        : (indirect string, offset: 0x158b4): main
    <ded>   DW_AT_decl_file   : 1
    <dee>   DW_AT_decl_line   : 70
    <def>   DW_AT_decl_column : 5
    <df0>   DW_AT_prototyped  : 1
    <df0>   DW_AT_type        : <0x86>
    <df4>   DW_AT_low_pc      : 0x80005dc
    <df8>   DW_AT_high_pc     : 0x6c
    <dfc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dfe>   DW_AT_call_all_tail_calls: 1
    <dfe>   DW_AT_sibling     : <0xe2d>
 <2><e02>: Abbrev Number: 8 (DW_TAG_variable)
    <e03>   DW_AT_name        : (indirect string, offset: 0xc1899): task1_handle
    <e07>   DW_AT_decl_file   : 1
    <e07>   DW_AT_decl_line   : 75
    <e08>   DW_AT_decl_column : 15
    <e09>   DW_AT_type        : <0xb59>
    <e0d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e10>: Abbrev Number: 8 (DW_TAG_variable)
    <e11>   DW_AT_name        : (indirect string, offset: 0xbef9f): task2_handle
    <e15>   DW_AT_decl_file   : 1
    <e15>   DW_AT_decl_line   : 76
    <e16>   DW_AT_decl_column : 15
    <e17>   DW_AT_type        : <0xb59>
    <e1b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e1e>: Abbrev Number: 8 (DW_TAG_variable)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x4aae3): xReturned
    <e23>   DW_AT_decl_file   : 1
    <e23>   DW_AT_decl_line   : 77
    <e24>   DW_AT_decl_column : 13
    <e25>   DW_AT_type        : <0xb41>
    <e29>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e2c>: Abbrev Number: 0
 <1><e2d>: Abbrev Number: 43 (DW_TAG_subprogram)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x74bee): __disable_irq
    <e32>   DW_AT_decl_file   : 2
    <e33>   DW_AT_decl_line   : 960
    <e35>   DW_AT_decl_column : 27
    <e36>   DW_AT_prototyped  : 1
    <e36>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><e37>: Abbrev Number: 0
  Compilation Unit @ offset 0xe38:
   Length:        0x295 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2bb
   Pointer Size:  4
 <0><e44>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <e45>   DW_AT_producer    : (indirect string, offset: 0xd1ad4): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e49>   DW_AT_language    : 29	(C11)
    <e4a>   DW_AT_name        : (indirect string, offset: 0xd6148): ../Core/Src/stm32f4xx_hal_msp.c
    <e4e>   DW_AT_comp_dir    : (indirect string, offset: 0xbdae): C:/RTOS/RTOS1/Debug
    <e52>   DW_AT_ranges      : 0x45
    <e56>   DW_AT_low_pc      : 0
    <e5a>   DW_AT_stmt_list   : 0xab9
    <e5e>   DW_AT_macros      : 0x21a16
 <1><e62>: Abbrev Number: 2 (DW_TAG_base_type)
    <e63>   DW_AT_byte_size   : 1
    <e64>   DW_AT_encoding    : 6	(signed char)
    <e65>   DW_AT_name        : (indirect string, offset: 0x69b77): signed char
 <1><e69>: Abbrev Number: 2 (DW_TAG_base_type)
    <e6a>   DW_AT_byte_size   : 1
    <e6b>   DW_AT_encoding    : 8	(unsigned char)
    <e6c>   DW_AT_name        : (indirect string, offset: 0xcd93a): unsigned char
 <1><e70>: Abbrev Number: 2 (DW_TAG_base_type)
    <e71>   DW_AT_byte_size   : 2
    <e72>   DW_AT_encoding    : 5	(signed)
    <e73>   DW_AT_name        : (indirect string, offset: 0x9e9e2): short int
 <1><e77>: Abbrev Number: 2 (DW_TAG_base_type)
    <e78>   DW_AT_byte_size   : 2
    <e79>   DW_AT_encoding    : 7	(unsigned)
    <e7a>   DW_AT_name        : (indirect string, offset: 0xcc1ed): short unsigned int
 <1><e7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <e7f>   DW_AT_byte_size   : 4
    <e80>   DW_AT_encoding    : 5	(signed)
    <e81>   DW_AT_name        : (indirect string, offset: 0x126c3): long int
 <1><e85>: Abbrev Number: 4 (DW_TAG_typedef)
    <e86>   DW_AT_name        : (indirect string, offset: 0x873f3): __uint32_t
    <e8a>   DW_AT_decl_file   : 2
    <e8b>   DW_AT_decl_line   : 79
    <e8c>   DW_AT_decl_column : 25
    <e8d>   DW_AT_type        : <0xe91>
 <1><e91>: Abbrev Number: 2 (DW_TAG_base_type)
    <e92>   DW_AT_byte_size   : 4
    <e93>   DW_AT_encoding    : 7	(unsigned)
    <e94>   DW_AT_name        : (indirect string, offset: 0x5090e): long unsigned int
 <1><e98>: Abbrev Number: 2 (DW_TAG_base_type)
    <e99>   DW_AT_byte_size   : 8
    <e9a>   DW_AT_encoding    : 5	(signed)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x60195): long long int
 <1><e9f>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea0>   DW_AT_byte_size   : 8
    <ea1>   DW_AT_encoding    : 7	(unsigned)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x2c912): long long unsigned int
 <1><ea6>: Abbrev Number: 7 (DW_TAG_base_type)
    <ea7>   DW_AT_byte_size   : 4
    <ea8>   DW_AT_encoding    : 5	(signed)
    <ea9>   DW_AT_name        : int
 <1><ead>: Abbrev Number: 2 (DW_TAG_base_type)
    <eae>   DW_AT_byte_size   : 4
    <eaf>   DW_AT_encoding    : 7	(unsigned)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x11c79): unsigned int
 <1><eb4>: Abbrev Number: 4 (DW_TAG_typedef)
    <eb5>   DW_AT_name        : (indirect string, offset: 0xcbd7b): uint32_t
    <eb9>   DW_AT_decl_file   : 3
    <eba>   DW_AT_decl_line   : 48
    <ebb>   DW_AT_decl_column : 20
    <ebc>   DW_AT_type        : <0xe85>
 <1><ec0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ec1>   DW_AT_type        : <0xeb4>
 <1><ec5>: Abbrev Number: 9 (DW_TAG_array_type)
    <ec6>   DW_AT_type        : <0xeb4>
    <eca>   DW_AT_sibling     : <0xed5>
 <2><ece>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ecf>   DW_AT_type        : <0xead>
    <ed3>   DW_AT_upper_bound : 1
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ed6>   DW_AT_byte_size   : 152
    <ed7>   DW_AT_decl_file   : 4
    <ed8>   DW_AT_decl_line   : 550
    <eda>   DW_AT_decl_column : 9
    <edb>   DW_AT_sibling     : <0x1077>
 <2><edf>: Abbrev Number: 3 (DW_TAG_member)
    <ee0>   DW_AT_name        : CR
    <ee3>   DW_AT_decl_file   : 4
    <ee3>   DW_AT_decl_line   : 552
    <ee5>   DW_AT_decl_column : 17
    <ee5>   DW_AT_type        : <0xec0>
    <ee9>   DW_AT_data_member_location: 0
 <2><eea>: Abbrev Number: 1 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x94b2f): PLLCFGR
    <eef>   DW_AT_decl_file   : 4
    <eef>   DW_AT_decl_line   : 553
    <ef1>   DW_AT_decl_column : 17
    <ef1>   DW_AT_type        : <0xec0>
    <ef5>   DW_AT_data_member_location: 4
 <2><ef6>: Abbrev Number: 1 (DW_TAG_member)
    <ef7>   DW_AT_name        : (indirect string, offset: 0xc1422): CFGR
    <efb>   DW_AT_decl_file   : 4
    <efb>   DW_AT_decl_line   : 554
    <efd>   DW_AT_decl_column : 17
    <efd>   DW_AT_type        : <0xec0>
    <f01>   DW_AT_data_member_location: 8
 <2><f02>: Abbrev Number: 3 (DW_TAG_member)
    <f03>   DW_AT_name        : CIR
    <f07>   DW_AT_decl_file   : 4
    <f07>   DW_AT_decl_line   : 555
    <f09>   DW_AT_decl_column : 17
    <f09>   DW_AT_type        : <0xec0>
    <f0d>   DW_AT_data_member_location: 12
 <2><f0e>: Abbrev Number: 1 (DW_TAG_member)
    <f0f>   DW_AT_name        : (indirect string, offset: 0xa96a9): AHB1RSTR
    <f13>   DW_AT_decl_file   : 4
    <f13>   DW_AT_decl_line   : 556
    <f15>   DW_AT_decl_column : 17
    <f15>   DW_AT_type        : <0xec0>
    <f19>   DW_AT_data_member_location: 16
 <2><f1a>: Abbrev Number: 1 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x8a3e4): AHB2RSTR
    <f1f>   DW_AT_decl_file   : 4
    <f1f>   DW_AT_decl_line   : 557
    <f21>   DW_AT_decl_column : 17
    <f21>   DW_AT_type        : <0xec0>
    <f25>   DW_AT_data_member_location: 20
 <2><f26>: Abbrev Number: 1 (DW_TAG_member)
    <f27>   DW_AT_name        : (indirect string, offset: 0x5b7cc): AHB3RSTR
    <f2b>   DW_AT_decl_file   : 4
    <f2b>   DW_AT_decl_line   : 558
    <f2d>   DW_AT_decl_column : 17
    <f2d>   DW_AT_type        : <0xec0>
    <f31>   DW_AT_data_member_location: 24
 <2><f32>: Abbrev Number: 1 (DW_TAG_member)
    <f33>   DW_AT_name        : (indirect string, offset: 0xc8de9): RESERVED0
    <f37>   DW_AT_decl_file   : 4
    <f37>   DW_AT_decl_line   : 559
    <f39>   DW_AT_decl_column : 17
    <f39>   DW_AT_type        : <0xeb4>
    <f3d>   DW_AT_data_member_location: 28
 <2><f3e>: Abbrev Number: 1 (DW_TAG_member)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x188e0): APB1RSTR
    <f43>   DW_AT_decl_file   : 4
    <f43>   DW_AT_decl_line   : 560
    <f45>   DW_AT_decl_column : 17
    <f45>   DW_AT_type        : <0xec0>
    <f49>   DW_AT_data_member_location: 32
 <2><f4a>: Abbrev Number: 1 (DW_TAG_member)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x5b244): APB2RSTR
    <f4f>   DW_AT_decl_file   : 4
    <f4f>   DW_AT_decl_line   : 561
    <f51>   DW_AT_decl_column : 17
    <f51>   DW_AT_type        : <0xec0>
    <f55>   DW_AT_data_member_location: 36
 <2><f56>: Abbrev Number: 1 (DW_TAG_member)
    <f57>   DW_AT_name        : (indirect string, offset: 0xc8df3): RESERVED1
    <f5b>   DW_AT_decl_file   : 4
    <f5b>   DW_AT_decl_line   : 562
    <f5d>   DW_AT_decl_column : 17
    <f5d>   DW_AT_type        : <0xec5>
    <f61>   DW_AT_data_member_location: 40
 <2><f62>: Abbrev Number: 1 (DW_TAG_member)
    <f63>   DW_AT_name        : (indirect string, offset: 0x11c0e): AHB1ENR
    <f67>   DW_AT_decl_file   : 4
    <f67>   DW_AT_decl_line   : 563
    <f69>   DW_AT_decl_column : 17
    <f69>   DW_AT_type        : <0xec0>
    <f6d>   DW_AT_data_member_location: 48
 <2><f6e>: Abbrev Number: 1 (DW_TAG_member)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x3857b): AHB2ENR
    <f73>   DW_AT_decl_file   : 4
    <f73>   DW_AT_decl_line   : 564
    <f75>   DW_AT_decl_column : 17
    <f75>   DW_AT_type        : <0xec0>
    <f79>   DW_AT_data_member_location: 52
 <2><f7a>: Abbrev Number: 1 (DW_TAG_member)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x5e78b): AHB3ENR
    <f7f>   DW_AT_decl_file   : 4
    <f7f>   DW_AT_decl_line   : 565
    <f81>   DW_AT_decl_column : 17
    <f81>   DW_AT_type        : <0xec0>
    <f85>   DW_AT_data_member_location: 56
 <2><f86>: Abbrev Number: 1 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0xc8dfd): RESERVED2
    <f8b>   DW_AT_decl_file   : 4
    <f8b>   DW_AT_decl_line   : 566
    <f8d>   DW_AT_decl_column : 17
    <f8d>   DW_AT_type        : <0xeb4>
    <f91>   DW_AT_data_member_location: 60
 <2><f92>: Abbrev Number: 1 (DW_TAG_member)
    <f93>   DW_AT_name        : (indirect string, offset: 0x7975c): APB1ENR
    <f97>   DW_AT_decl_file   : 4
    <f97>   DW_AT_decl_line   : 567
    <f99>   DW_AT_decl_column : 17
    <f99>   DW_AT_type        : <0xec0>
    <f9d>   DW_AT_data_member_location: 64
 <2><f9e>: Abbrev Number: 1 (DW_TAG_member)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x1a3dc): APB2ENR
    <fa3>   DW_AT_decl_file   : 4
    <fa3>   DW_AT_decl_line   : 568
    <fa5>   DW_AT_decl_column : 17
    <fa5>   DW_AT_type        : <0xec0>
    <fa9>   DW_AT_data_member_location: 68
 <2><faa>: Abbrev Number: 1 (DW_TAG_member)
    <fab>   DW_AT_name        : (indirect string, offset: 0xc8e07): RESERVED3
    <faf>   DW_AT_decl_file   : 4
    <faf>   DW_AT_decl_line   : 569
    <fb1>   DW_AT_decl_column : 17
    <fb1>   DW_AT_type        : <0xec5>
    <fb5>   DW_AT_data_member_location: 72
 <2><fb6>: Abbrev Number: 1 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0xadaa2): AHB1LPENR
    <fbb>   DW_AT_decl_file   : 4
    <fbb>   DW_AT_decl_line   : 570
    <fbd>   DW_AT_decl_column : 17
    <fbd>   DW_AT_type        : <0xec0>
    <fc1>   DW_AT_data_member_location: 80
 <2><fc2>: Abbrev Number: 1 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x2faa5): AHB2LPENR
    <fc7>   DW_AT_decl_file   : 4
    <fc7>   DW_AT_decl_line   : 571
    <fc9>   DW_AT_decl_column : 17
    <fc9>   DW_AT_type        : <0xec0>
    <fcd>   DW_AT_data_member_location: 84
 <2><fce>: Abbrev Number: 1 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x8fa11): AHB3LPENR
    <fd3>   DW_AT_decl_file   : 4
    <fd3>   DW_AT_decl_line   : 572
    <fd5>   DW_AT_decl_column : 17
    <fd5>   DW_AT_type        : <0xec0>
    <fd9>   DW_AT_data_member_location: 88
 <2><fda>: Abbrev Number: 1 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xc8e11): RESERVED4
    <fdf>   DW_AT_decl_file   : 4
    <fdf>   DW_AT_decl_line   : 573
    <fe1>   DW_AT_decl_column : 17
    <fe1>   DW_AT_type        : <0xeb4>
    <fe5>   DW_AT_data_member_location: 92
 <2><fe6>: Abbrev Number: 1 (DW_TAG_member)
    <fe7>   DW_AT_name        : (indirect string, offset: 0xb2d04): APB1LPENR
    <feb>   DW_AT_decl_file   : 4
    <feb>   DW_AT_decl_line   : 574
    <fed>   DW_AT_decl_column : 17
    <fed>   DW_AT_type        : <0xec0>
    <ff1>   DW_AT_data_member_location: 96
 <2><ff2>: Abbrev Number: 1 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x23a85): APB2LPENR
    <ff7>   DW_AT_decl_file   : 4
    <ff7>   DW_AT_decl_line   : 575
    <ff9>   DW_AT_decl_column : 17
    <ff9>   DW_AT_type        : <0xec0>
    <ffd>   DW_AT_data_member_location: 100
 <2><ffe>: Abbrev Number: 1 (DW_TAG_member)
    <fff>   DW_AT_name        : (indirect string, offset: 0xc8e1b): RESERVED5
    <1003>   DW_AT_decl_file   : 4
    <1003>   DW_AT_decl_line   : 576
    <1005>   DW_AT_decl_column : 17
    <1005>   DW_AT_type        : <0xec5>
    <1009>   DW_AT_data_member_location: 104
 <2><100a>: Abbrev Number: 1 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x50513): BDCR
    <100f>   DW_AT_decl_file   : 4
    <100f>   DW_AT_decl_line   : 577
    <1011>   DW_AT_decl_column : 17
    <1011>   DW_AT_type        : <0xec0>
    <1015>   DW_AT_data_member_location: 112
 <2><1016>: Abbrev Number: 3 (DW_TAG_member)
    <1017>   DW_AT_name        : CSR
    <101b>   DW_AT_decl_file   : 4
    <101b>   DW_AT_decl_line   : 578
    <101d>   DW_AT_decl_column : 17
    <101d>   DW_AT_type        : <0xec0>
    <1021>   DW_AT_data_member_location: 116
 <2><1022>: Abbrev Number: 1 (DW_TAG_member)
    <1023>   DW_AT_name        : (indirect string, offset: 0x7e4cc): RESERVED6
    <1027>   DW_AT_decl_file   : 4
    <1027>   DW_AT_decl_line   : 579
    <1029>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0xec5>
    <102d>   DW_AT_data_member_location: 120
 <2><102e>: Abbrev Number: 1 (DW_TAG_member)
    <102f>   DW_AT_name        : (indirect string, offset: 0x70050): SSCGR
    <1033>   DW_AT_decl_file   : 4
    <1033>   DW_AT_decl_line   : 580
    <1035>   DW_AT_decl_column : 17
    <1035>   DW_AT_type        : <0xec0>
    <1039>   DW_AT_data_member_location: 128
 <2><103a>: Abbrev Number: 1 (DW_TAG_member)
    <103b>   DW_AT_name        : (indirect string, offset: 0x465e2): PLLI2SCFGR
    <103f>   DW_AT_decl_file   : 4
    <103f>   DW_AT_decl_line   : 581
    <1041>   DW_AT_decl_column : 17
    <1041>   DW_AT_type        : <0xec0>
    <1045>   DW_AT_data_member_location: 132
 <2><1046>: Abbrev Number: 1 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0xc141c): PLLSAICFGR
    <104b>   DW_AT_decl_file   : 4
    <104b>   DW_AT_decl_line   : 582
    <104d>   DW_AT_decl_column : 17
    <104d>   DW_AT_type        : <0xec0>
    <1051>   DW_AT_data_member_location: 136
 <2><1052>: Abbrev Number: 1 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0x5b996): DCKCFGR
    <1057>   DW_AT_decl_file   : 4
    <1057>   DW_AT_decl_line   : 583
    <1059>   DW_AT_decl_column : 17
    <1059>   DW_AT_type        : <0xec0>
    <105d>   DW_AT_data_member_location: 140
 <2><105e>: Abbrev Number: 1 (DW_TAG_member)
    <105f>   DW_AT_name        : (indirect string, offset: 0xa3729): CKGATENR
    <1063>   DW_AT_decl_file   : 4
    <1063>   DW_AT_decl_line   : 584
    <1065>   DW_AT_decl_column : 17
    <1065>   DW_AT_type        : <0xec0>
    <1069>   DW_AT_data_member_location: 144
 <2><106a>: Abbrev Number: 1 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x93509): DCKCFGR2
    <106f>   DW_AT_decl_file   : 4
    <106f>   DW_AT_decl_line   : 585
    <1071>   DW_AT_decl_column : 17
    <1071>   DW_AT_type        : <0xec0>
    <1075>   DW_AT_data_member_location: 148
 <2><1076>: Abbrev Number: 0
 <1><1077>: Abbrev Number: 12 (DW_TAG_typedef)
    <1078>   DW_AT_name        : (indirect string, offset: 0x6185e): RCC_TypeDef
